TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
       3                    ;* Date/Time created: Tue Jan 24 12:32:25 2012                                *
       4                    ;******************************************************************************
       5 00000000                   .state16
       6                    
       7                    DWCU    .dwtag  DW_TAG_compile_unit
       8                            .dwattr DWCU, DW_AT_name("ADLATUS_HalRAM.c")
       9                            .dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Tex
      10                            .dwattr DWCU, DW_AT_stmt_list(0x00)
      11                            .dwattr DWCU, DW_AT_TI_VERSION(0x01)
      12                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("t_CChal_HalCtrl_ST"), DW_AT_symbol_name("_t_CChal_HalCtrl
      13                            .dwattr DW$1, DW_AT_type(*DWT$1026)
      14                            .dwattr DW$1, DW_AT_declaration(0x01)
      15                            .dwattr DW$1, DW_AT_external(0x01)

     349                    ;** 239 -----------------------    return;
     350                            .dwpsn  "ADLATUS_HalRAM.c",239,3
     351                    ;----------------------------------------------------------------------
     352                    ; 239 | return;                                                                
     353                    ;----------------------------------------------------------------------
     354                            .dwpsn  "ADLATUS_HalRAM.c",241,1
     355 00000046 4770              BX        LR
     356                            .dwendentry
     357                            .dwendtag DW$16
     358                    
     359                    
     360                    
     361                    ;******************************************************************************
     362                    ;* CONSTANT TABLE                                                             *
     363                    ;******************************************************************************
     364 00000048                   .sect   ".text"
     365                            .align  4
     366 00000048 00000000! CON1:   .field          _e_SARRTI_ST,32
     367                            .align  4
     368 0000004c 00000000! CON2:   .field          _t_CChal_HalCtrl_ST,32
     369                            .align  4
     370 00000050 00000024! CON3:   .field          _e_GIO_ST+36,32
     371                    ;******************************************************************************
     372                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     373                    ;******************************************************************************
     374                            .global _t_CChal_HalCtrl_ST
     375                            .global _e_SARRTI_ST
     376                            .global _e_GIO_ST
     377                    
     378                    ;******************************************************************************
     379                    ;* TYPE INFORMATION                                                           *
     380                    ;******************************************************************************
     381                    DWT$1018        .dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
     382                            .dwattr DWT$1018, DW_AT_language(DW_LANG_C)
     383                    
     384                    DWT$1019        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1018)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE    8

     385                            .dwattr DWT$1019, DW_AT_language(DW_LANG_C)
     386                    DWT$10  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     387                            .dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
     388                            .dwattr DWT$10, DW_AT_byte_size(0x04)
     389                    DWT$1023        .dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
     390                            .dwattr DWT$1023, DW_AT_language(DW_LANG_C)
     391                    
     392                    DWT$1024        .dwtag  DW_TAG_subroutine_type
     393                            .dwattr DWT$1024, DW_AT_language(DW_LANG_C)
     394                    DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1018)
     395                            .dwendtag DWT$1024
     396                    
     397                    DWT$1026        .dwtag  DW_TAG_typedef, DW_AT_name("HALCONTROL_ST"), DW_AT_type(*DWT$1025)
     398                            .dwattr DWT$1026, DW_AT_language(DW_LANG_C)
     399                    DWT$1027        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1026)
     400                            .dwattr DWT$1027, DW_AT_address_class(0x20)
     401                    DWT$1028        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1025)
     402                            .dwattr DWT$1028, DW_AT_address_class(0x20)
     403                    DWT$1041        .dwtag  DW_TAG_typedef, DW_AT_name("SARRTI_ST"), DW_AT_type(*DWT$1040)
     404                            .dwattr DWT$1041, DW_AT_language(DW_LANG_C)
     405                    DWT$1042        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1040)
     406                            .dwattr DWT$1042, DW_AT_address_class(0x20)
     407                    DWT$1047        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1046)
     408                            .dwattr DWT$1047, DW_AT_address_class(0x20)
     409                    DWT$1052        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_ST"), DW_AT_type(*DWT$1051)
     410                            .dwattr DWT$1052, DW_AT_language(DW_LANG_C)
     411                    DWT$8   .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     412                            .dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
     413                            .dwattr DWT$8, DW_AT_byte_size(0x02)
     414                    DWT$12  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     415                            .dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
     416                            .dwattr DWT$12, DW_AT_byte_size(0x04)
     417                    
     418                    DWT$1025        .dwtag  DW_TAG_structure_type
     419                            .dwattr DWT$1025, DW_AT_name("_HALCONTROL")
     420                            .dwattr DWT$1025, DW_AT_byte_size(0x14)
     421                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1023)
     422                            .dwattr DW$22, DW_AT_name("IntClockFrequency_UL"), DW_AT_symbol_name("_IntClockFrequency_UL")
     423                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     425                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     426                            .dwattr DW$23, DW_AT_name("IntWatchdogTriggerTime_UW"), DW_AT_symbol_name("_IntWatchdogTrigger
     427                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     428                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     429                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     430                            .dwattr DW$24, DW_AT_name("IntWtdTimerReloadValue_UW"), DW_AT_symbol_name("_IntWtdTimerReloadV
     431                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     432                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     433                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     434                            .dwattr DW$25, DW_AT_name("HWTimerValue_UW"), DW_AT_symbol_name("_HWTimerValue_UW")
     435                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     436                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     437                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1023)
     438                            .dwattr DW$26, DW_AT_name("OldTimerValue_UL"), DW_AT_symbol_name("_OldTimerValue_UL")
     439                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE    9

     440                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     441                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1023)
     442                            .dwattr DW$27, DW_AT_name("TimerTicksForOneMilliSecond_UL"), DW_AT_symbol_name("_TimerTicksFor
     443                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     444                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     445                            .dwendtag DWT$1025
     446                    
     447                    DWT$1040        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1039)
     448                    
     449                    DWT$1046        .dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1044)
     450                            .dwattr DWT$1046, DW_AT_language(DW_LANG_C)
     451                            .dwattr DWT$1046, DW_AT_byte_size(0xa0)
     452                    DW$28   .dwtag  DW_TAG_subrange_type
     453                            .dwattr DW$28, DW_AT_upper_bound(0x07)
     454                            .dwendtag DWT$1046
     455                    
     456                    DWT$1051        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1050)
     457                    
     458                    DWT$1039        .dwtag  DW_TAG_structure_type
     459                            .dwattr DWT$1039, DW_AT_name("rti")
     460                            .dwattr DWT$1039, DW_AT_byte_size(0x20)
     461                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
     462                            .dwattr DW$29, DW_AT_name("DRTICNTR_UN"), DW_AT_symbol_name("_DRTICNTR_UN")
     463                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     465                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1032)
     466                            .dwattr DW$30, DW_AT_name("DRTIPCTL_UN"), DW_AT_symbol_name("_DRTIPCTL_UN")
     467                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     468                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     469                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1034)
     470                            .dwattr DW$31, DW_AT_name("DRTICNTL_UN"), DW_AT_symbol_name("_DRTICNTL_UN")
     471                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     472                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     473                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     474                            .dwattr DW$32, DW_AT_name("WKEY_UL"), DW_AT_symbol_name("_WKEY_UL")
     475                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     476                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     477                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     478                            .dwattr DW$33, DW_AT_name("RTICR1_UL"), DW_AT_symbol_name("_RTICR1_UL")
     479                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     480                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     481                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     482                            .dwattr DW$34, DW_AT_name("RTICR2_UL"), DW_AT_symbol_name("_RTICR2_UL")
     483                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     484                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     485                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1036)
     486                            .dwattr DW$35, DW_AT_name("DRTICINT_UN"), DW_AT_symbol_name("_DRTICINT_UN")
     487                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     488                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     489                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1038)
     490                            .dwattr DW$36, DW_AT_name("DRTICNTEN_UN"), DW_AT_symbol_name("_DRTICNTEN_UN")
     491                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     492                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     493                            .dwendtag DWT$1039
     494                    
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   10

     495                    DWT$1044        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1043)
     496                    
     497                    DWT$1050        .dwtag  DW_TAG_structure_type
     498                            .dwattr DWT$1050, DW_AT_name("gio_st")
     499                            .dwattr DWT$1050, DW_AT_byte_size(0xc4)
     500                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1048)
     501                            .dwattr DW$37, DW_AT_name("Pwdn_ST"), DW_AT_symbol_name("_Pwdn_ST")
     502                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     504                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     505                            .dwattr DW$38, DW_AT_name("Ena_UB"), DW_AT_symbol_name("_Ena_UB")
     506                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     507                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     508                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     509                            .dwattr DW$39, DW_AT_name("Pol_UB"), DW_AT_symbol_name("_Pol_UB")
     510                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     511                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     512                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     513                            .dwattr DW$40, DW_AT_name("Flg_UB"), DW_AT_symbol_name("_Flg_UB")
     514                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     515                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     516                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     517                            .dwattr DW$41, DW_AT_name("Pry_UB"), DW_AT_symbol_name("_Pry_UB")
     518                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     519                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     520                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     521                            .dwattr DW$42, DW_AT_name("OffA_UB"), DW_AT_symbol_name("_OffA_UB")
     522                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     523                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     524                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     525                            .dwattr DW$43, DW_AT_name("EmuA_UB"), DW_AT_symbol_name("_EmuA_UB")
     526                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     527                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     528                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     529                            .dwattr DW$44, DW_AT_name("OffB_UB"), DW_AT_symbol_name("_OffB_UB")
     530                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
     531                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     532                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     533                            .dwattr DW$45, DW_AT_name("EmuB_UB"), DW_AT_symbol_name("_EmuB_UB")
     534                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     535                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     536                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1049)
     537                            .dwattr DW$46, DW_AT_name("Port_ST"), DW_AT_symbol_name("_Port_ST")
     538                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     539                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     540                            .dwendtag DWT$1050
     541                    
     542                    DWT$6   .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     543                            .dwattr DWT$6, DW_AT_encoding(DW_ATE_unsigned_char)
     544                            .dwattr DWT$6, DW_AT_byte_size(0x01)
     545                    
     546                    DWT$1030        .dwtag  DW_TAG_union_type
     547                            .dwattr DWT$1030, DW_AT_byte_size(0x04)
     548                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     549                            .dwattr DW$47, DW_AT_name("DRTICNTR_UL"), DW_AT_symbol_name("_DRTICNTR_UL")
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   11

     550                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     551                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     552                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1029)
     553                            .dwattr DW$48, DW_AT_name("DRTICNTR_ST"), DW_AT_symbol_name("_DRTICNTR_ST")
     554                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     556                            .dwendtag DWT$1030
     557                    
     558                    
     559                    DWT$1032        .dwtag  DW_TAG_union_type
     560                            .dwattr DWT$1032, DW_AT_byte_size(0x04)
     561                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     562                            .dwattr DW$49, DW_AT_name("DRTIPCTL_UL"), DW_AT_symbol_name("_DRTIPCTL_UL")
     563                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     565                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1031)
     566                            .dwattr DW$50, DW_AT_name("DRTIPCTL_ST"), DW_AT_symbol_name("_DRTIPCTL_ST")
     567                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     569                            .dwendtag DWT$1032
     570                    
     571                    
     572                    DWT$1034        .dwtag  DW_TAG_union_type
     573                            .dwattr DWT$1034, DW_AT_byte_size(0x04)
     574                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     575                            .dwattr DW$51, DW_AT_name("DRTICNTL_UL"), DW_AT_symbol_name("_DRTICNTL_UL")
     576                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     578                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1033)
     579                            .dwattr DW$52, DW_AT_name("DRTICNTL_ST"), DW_AT_symbol_name("_DRTICNTL_ST")
     580                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     582                            .dwendtag DWT$1034
     583                    
     584                    
     585                    DWT$1036        .dwtag  DW_TAG_union_type
     586                            .dwattr DWT$1036, DW_AT_byte_size(0x04)
     587                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     588                            .dwattr DW$53, DW_AT_name("DRTICINT_UL"), DW_AT_symbol_name("_DRTICINT_UL")
     589                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     591                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
     592                            .dwattr DW$54, DW_AT_name("DRTICINT_ST"), DW_AT_symbol_name("_DRTICINT_ST")
     593                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     595                            .dwendtag DWT$1036
     596                    
     597                    
     598                    DWT$1038        .dwtag  DW_TAG_union_type
     599                            .dwattr DWT$1038, DW_AT_byte_size(0x04)
     600                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     601                            .dwattr DW$55, DW_AT_name("DRTICNTEN_UL"), DW_AT_symbol_name("_DRTICNTEN_UL")
     602                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     604                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1037)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   12

     605                            .dwattr DW$56, DW_AT_name("DRTICNTEN_ST"), DW_AT_symbol_name("_DRTICNTEN_ST")
     606                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     608                            .dwendtag DWT$1038
     609                    
     610                    
     611                    DWT$1043        .dwtag  DW_TAG_structure_type
     612                            .dwattr DWT$1043, DW_AT_byte_size(0x14)
     613                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     614                            .dwattr DW$57, DW_AT_name("Dir_UL"), DW_AT_symbol_name("_Dir_UL")
     615                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     617                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     618                            .dwattr DW$58, DW_AT_name("Din_UL"), DW_AT_symbol_name("_Din_UL")
     619                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     620                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     621                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     622                            .dwattr DW$59, DW_AT_name("Dout_UL"), DW_AT_symbol_name("_Dout_UL")
     623                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     624                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     625                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     626                            .dwattr DW$60, DW_AT_name("Dset_UL"), DW_AT_symbol_name("_Dset_UL")
     627                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     628                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     629                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
     630                            .dwattr DW$61, DW_AT_name("Dclr_UL"), DW_AT_symbol_name("_Dclr_UL")
     631                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     632                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     633                            .dwendtag DWT$1043
     634                    
     635                    
     636                    DWT$1049        .dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1043)
     637                            .dwattr DWT$1049, DW_AT_language(DW_LANG_C)
     638                            .dwattr DWT$1049, DW_AT_byte_size(0xa0)
     639                    DW$62   .dwtag  DW_TAG_subrange_type
     640                            .dwattr DW$62, DW_AT_upper_bound(0x07)
     641                            .dwendtag DWT$1049
     642                    
     643                    
     644                    DWT$1048        .dwtag  DW_TAG_structure_type
     645                            .dwattr DWT$1048, DW_AT_byte_size(0x04)
     646                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     647                            .dwattr DW$63, DW_AT_name("Pwdn_B1"), DW_AT_symbol_name("_Pwdn_B1")
     648                            .dwattr DW$63, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     649                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     651                            .dwendtag DWT$1048
     652                    
     653                    
     654                    DWT$1029        .dwtag  DW_TAG_structure_type
     655                            .dwattr DWT$1029, DW_AT_byte_size(0x04)
     656                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     657                            .dwattr DW$64, DW_AT_name("DRTICNTR_B21"), DW_AT_symbol_name("_DRTICNTR_B21")
     658                            .dwattr DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x15)
     659                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   13

     660                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     661                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     662                            .dwattr DW$65, DW_AT_name("DRTIMOD_B11"), DW_AT_symbol_name("_DRTIMOD_B11")
     663                            .dwattr DW$65, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
     664                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     666                            .dwendtag DWT$1029
     667                    
     668                    
     669                    DWT$1031        .dwtag  DW_TAG_structure_type
     670                            .dwattr DWT$1031, DW_AT_byte_size(0x04)
     671                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     672                            .dwattr DW$66, DW_AT_name("RTIM_B3"), DW_AT_symbol_name("_RTIM_B3")
     673                            .dwattr DW$66, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x03)
     674                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     676                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     677                            .dwattr DW$67, DW_AT_name("PREDL_B11"), DW_AT_symbol_name("_PREDL_B11")
     678                            .dwattr DW$67, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
     679                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     681                            .dwendtag DWT$1031
     682                    
     683                    
     684                    DWT$1033        .dwtag  DW_TAG_structure_type
     685                            .dwattr DWT$1033, DW_AT_byte_size(0x04)
     686                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     687                            .dwattr DW$68, DW_AT_name("RTIF_B1"), DW_AT_symbol_name("_RTIF_B1")
     688                            .dwattr DW$68, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     689                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     691                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     692                            .dwattr DW$69, DW_AT_name("RTIE_B1"), DW_AT_symbol_name("_RTIE_B1")
     693                            .dwattr DW$69, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     694                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     696                            .dwendtag DWT$1033
     697                    
     698                    
     699                    DWT$1035        .dwtag  DW_TAG_structure_type
     700                            .dwattr DWT$1035, DW_AT_byte_size(0x04)
     701                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     702                            .dwattr DW$70, DW_AT_name("CF1_B1"), DW_AT_symbol_name("_CF1_B1")
     703                            .dwattr DW$70, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     704                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     706                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     707                            .dwattr DW$71, DW_AT_name("CF2_B1"), DW_AT_symbol_name("_CF2_B1")
     708                            .dwattr DW$71, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     709                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     711                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     712                            .dwattr DW$72, DW_AT_name("CE1_B1"), DW_AT_symbol_name("_CE1_B1")
     713                            .dwattr DW$72, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     714                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   14

     715                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     716                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     717                            .dwattr DW$73, DW_AT_name("CR2_B1"), DW_AT_symbol_name("_CR2_B1")
     718                            .dwattr DW$73, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     719                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     721                            .dwendtag DWT$1035
     722                    
     723                    
     724                    DWT$1037        .dwtag  DW_TAG_structure_type
     725                            .dwattr DWT$1037, DW_AT_byte_size(0x04)
     726                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
     727                            .dwattr DW$74, DW_AT_name("CNTEN_B2"), DW_AT_symbol_name("_CNTEN_B2")
     728                            .dwattr DW$74, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     729                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     731                            .dwendtag DWT$1037
     732                    
     733                    
     734                            .dwattr DW$5, DW_AT_external(0x01)
     735                            .dwattr DW$5, DW_AT_type(*DWT$1018)
     736                            .dwattr DW$16, DW_AT_external(0x01)
     737                            .dwattr DWCU, DW_AT_language(DW_LANG_C)
     738                    
     739                    ;***************************************************************
     740                    ;* DWARF CIE ENTRIES                                           *
     741                    ;***************************************************************
     742                    
     743                    DW$CIE  .dwcie 1, 26
     744                            .dwcfa  0x0c, 13, 0
     745                            .dwcfa  0x07, 0
     746                            .dwcfa  0x07, 1
     747                            .dwcfa  0x07, 2
     748                            .dwcfa  0x07, 3
     749                            .dwcfa  0x08, 4
     750                            .dwcfa  0x08, 5
     751                            .dwcfa  0x08, 6
     752                            .dwcfa  0x08, 7
     753                            .dwcfa  0x08, 8
     754                            .dwcfa  0x08, 9
     755                            .dwcfa  0x08, 10
     756                            .dwcfa  0x08, 11
     757                            .dwcfa  0x07, 12
     758                            .dwcfa  0x07, 13
     759                            .dwcfa  0x07, 14
     760                            .dwcfa  0x07, 15
     761                            .dwcfa  0x07, 16
     762                            .dwcfa  0x07, 17
     763                            .dwcfa  0x07, 18
     764                            .dwcfa  0x07, 19
     765                            .dwcfa  0x07, 20
     766                            .dwcfa  0x07, 21
     767                            .dwcfa  0x07, 22
     768                            .dwcfa  0x07, 23
     769                            .dwcfa  0x07, 24
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:25 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_HalRAM.asm                               PAGE   15

     770                            .dwcfa  0x07, 25
     771                            .dwcfa  0x07, 26
     772                    
     773                    ;***************************************************************
     774                    ;* DWARF REGISTER MAP                                          *
     775                    ;***************************************************************
     776                    
     777                    DW$75   .dwtag  DW_TAG_assign_register, DW_AT_name("A1")
     778                            .dwattr DW$75, DW_AT_location[DW_OP_reg0]
     779                    DW$76   .dwtag  DW_TAG_assign_register, DW_AT_name("A2")
     780                            .dwattr DW$76, DW_AT_location[DW_OP_reg1]
     781                    DW$77   .dwtag  DW_TAG_assign_register, DW_AT_name("A3")
     782                            .dwattr DW$77, DW_AT_location[DW_OP_reg2]
     783                    DW$78   .dwtag  DW_TAG_assign_register, DW_AT_name("A4")
     784                            .dwattr DW$78, DW_AT_location[DW_OP_reg3]
     785                    DW$79   .dwtag  DW_TAG_assign_register, DW_AT_name("V1")
     786                            .dwattr DW$79, DW_AT_location[DW_OP_reg4]
     787                    DW$80   .dwtag  DW_TAG_assign_register, DW_AT_name("V2")
     788                            .dwattr DW$80, DW_AT_location[DW_OP_reg5]
