TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
       3                    ;* Date/Time created: Tue Jan 24 12:32:23 2012                                *
       4                    ;******************************************************************************
       5 00000000                   .state16
       6                    
       7                    DWCU    .dwtag  DW_TAG_compile_unit
       8                            .dwattr DWCU, DW_AT_name("ADLATUS_FUN_CChal_HISCheck.c")
       9                            .dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Tex
      10                            .dwattr DWCU, DW_AT_stmt_list(0x00)
      11                            .dwattr DWCU, DW_AT_TI_VERSION(0x01)
      12                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("C_FlashDelay_UL"), DW_AT_symbol_name("_C_FlashDelay_UL")
      13                            .dwattr DW$1, DW_AT_type(*DWT$1050)
      14                            .dwattr DW$1, DW_AT_declaration(0x01)
      15                            .dwattr DW$1, DW_AT_external(0x01)

     235                    ; 137 | t_Result_UB = (d_CCglo_Error | 0x02);                                  
     236                    ;----------------------------------------------------------------------
     237 00000048 2022              MOV       A1, #34               ; |137| 
     238 0000004a BD10              POP       {V1, PC}
     239                    ;* --------------------------------------------------------------------------*
     240                    L5:    
     241                    ;**     -----------------------g5:
     242                    ;** 119 -----------------------    t_Result_UB = 33u;
     243                            .dwpsn  "ADLATUS_FUN_CChal_HISCheck.c",119,5
     244 0000004c 2121              MOV       A2, #33               ; |119| 
     245                    ;* --------------------------------------------------------------------------*
     246                    L6:    
     247                    ;**     -----------------------g6:
     248                    ;** 141 -----------------------    return t_Result_UB;
     249                            .dwpsn  "ADLATUS_FUN_CChal_HISCheck.c",141,3
     250                    ;----------------------------------------------------------------------
     251                    ; 141 | return t_Result_UB;                                                    
     252                    ;----------------------------------------------------------------------
     253 0000004e 1C08              MOV       A1, A2
     254                            .dwpsn  "ADLATUS_FUN_CChal_HISCheck.c",142,2
     255                            .dwcfa  0x0e, 8
     256 00000050 BD10              POP       {V1, PC}
     257                            .dwendentry
     258                            .dwendtag DW$5
     259                    
     260                    
     261                    
     262                    ;******************************************************************************
     263                    ;* CONSTANT TABLE                                                             *
     264                    ;******************************************************************************
     265 00000052                   .sect   ".text"
     266                            .align  4
     267 00000054 00000000- CON1:   .field          _FlashParam,32
     268                            .align  4
     269 00000058 00000000! CON2:   .field          _C_FlashDelay_UL,32
     270                            .align  4
     271 0000005c 00000010! CON3:   .field          _t_CChal_HalCtrl_ST+16,32
     272                            .align  4
     273 00000060 00401000  CON4:   .field          4198400,32
     274                    ;******************************************************************************
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE    6

     275                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     276                    ;******************************************************************************
     277                            .global _C_FlashDelay_UL
     278                            .global _t_CChal_HalCtrl_ST
     279                    
     280                    ;******************************************************************************
     281                    ;* TYPE INFORMATION                                                           *
     282                    ;******************************************************************************
     283                    DWT$6   .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     284                            .dwattr DWT$6, DW_AT_encoding(DW_ATE_unsigned_char)
     285                            .dwattr DWT$6, DW_AT_byte_size(0x01)
     286                    DWT$1018        .dwtag  DW_TAG_typedef, DW_AT_name("UBYTE"), DW_AT_type(*DWT$6)
     287                            .dwattr DWT$1018, DW_AT_language(DW_LANG_C)
     288                    
     289                    DWT$1046        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1018)
     290                            .dwattr DWT$1046, DW_AT_language(DW_LANG_C)
     291                    DW$14   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1045)
     292                            .dwendtag DWT$1046
     293                    
     294                    DWT$1050        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1049)
     295                    DWT$1038        .dwtag  DW_TAG_typedef, DW_AT_name("tFlashParam"), DW_AT_type(*DWT$1037)
     296                            .dwattr DWT$1038, DW_AT_language(DW_LANG_C)
     297                    DWT$1051        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1037)
     298                            .dwattr DWT$1051, DW_AT_address_class(0x20)
     299                    DWT$1045        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1044)
     300                            .dwattr DWT$1045, DW_AT_address_class(0x20)
     301                    DWT$1052        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1045)
     302                    DWT$1057        .dwtag  DW_TAG_typedef, DW_AT_name("HALCONTROL_ST"), DW_AT_type(*DWT$1056)
     303                            .dwattr DWT$1057, DW_AT_language(DW_LANG_C)
     304                    DWT$1049        .dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
     305                            .dwattr DWT$1049, DW_AT_language(DW_LANG_C)
     306                    
     307                    DWT$1037        .dwtag  DW_TAG_structure_type
     308                            .dwattr DWT$1037, DW_AT_byte_size(0x30)
     309                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
     310                            .dwattr DW$15, DW_AT_name("patchlevel"), DW_AT_symbol_name("_patchlevel")
     311                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     312                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     313                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1020)
     314                            .dwattr DW$16, DW_AT_name("minornumber"), DW_AT_symbol_name("_minornumber")
     315                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     316                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     317                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
     318                            .dwattr DW$17, DW_AT_name("majornumber"), DW_AT_symbol_name("_majornumber")
     319                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     320                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     321                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
     322                            .dwattr DW$18, DW_AT_name("reserved1"), DW_AT_symbol_name("_reserved1")
     323                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     324                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     325                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
     326                            .dwattr DW$19, DW_AT_name("errorcode"), DW_AT_symbol_name("_errorcode")
     327                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     328                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     329                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE    7

     330                            .dwattr DW$20, DW_AT_name("reserved2"), DW_AT_symbol_name("_reserved2")
     331                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     332                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     333                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1023)
     334                            .dwattr DW$21, DW_AT_name("address"), DW_AT_symbol_name("_address")
     335                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     336                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     337                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1024)
     338                            .dwattr DW$22, DW_AT_name("length"), DW_AT_symbol_name("_length")
     339                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     340                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     341                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1026)
     342                            .dwattr DW$23, DW_AT_name("data"), DW_AT_symbol_name("_data")
     343                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     344                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     345                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1029)
     346                            .dwattr DW$24, DW_AT_name("wdTriggerFct"), DW_AT_symbol_name("_wdTriggerFct")
     347                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     348                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     349                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
     350                            .dwattr DW$25, DW_AT_name("intendedData"), DW_AT_symbol_name("_intendedData")
     351                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     352                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     353                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
     354                            .dwattr DW$26, DW_AT_name("actualData"), DW_AT_symbol_name("_actualData")
     355                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     356                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     357                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1023)
     358                            .dwattr DW$27, DW_AT_name("errorAddress"), DW_AT_symbol_name("_errorAddress")
     359                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     360                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     361                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1031)
     362                            .dwattr DW$28, DW_AT_name("Command_UB"), DW_AT_symbol_name("_Command_UB")
     363                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     364                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     365                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1032)
     366                            .dwattr DW$29, DW_AT_name("Direction_UB"), DW_AT_symbol_name("_Direction_UB")
     367                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
     368                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     369                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1033)
     370                            .dwattr DW$30, DW_AT_name("Format_UB"), DW_AT_symbol_name("_Format_UB")
     371                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     372                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     373                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1034)
     374                            .dwattr DW$31, DW_AT_name("Millisec_UB"), DW_AT_symbol_name("_Millisec_UB")
     375                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
     376                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     377                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
     378                            .dwattr DW$32, DW_AT_name("StartSector_US"), DW_AT_symbol_name("_StartSector_US")
     379                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     380                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     381                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
     382                            .dwattr DW$33, DW_AT_name("EndSector_US"), DW_AT_symbol_name("_EndSector_US")
     383                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     384                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE    8

     385                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
     386                            .dwattr DW$34, DW_AT_name("NbrOfSectors_US"), DW_AT_symbol_name("_NbrOfSectors_US")
     387                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     388                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     389                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
     390                            .dwattr DW$35, DW_AT_name("ActualSector_US"), DW_AT_symbol_name("_ActualSector_US")
     391                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     392                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     393                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1036)
     394                            .dwattr DW$36, DW_AT_name("Delaytime_UL"), DW_AT_symbol_name("_Delaytime_UL")
     395                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     396                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     397                            .dwendtag DWT$1037
     398                    
     399                    DWT$1044        .dwtag  DW_TAG_typedef, DW_AT_name("tHis_Header"), DW_AT_type(*DWT$1043)
     400                            .dwattr DWT$1044, DW_AT_language(DW_LANG_C)
     401                    
     402                    DWT$1056        .dwtag  DW_TAG_structure_type
     403                            .dwattr DWT$1056, DW_AT_name("_HALCONTROL")
     404                            .dwattr DWT$1056, DW_AT_byte_size(0x14)
     405                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1049)
     406                            .dwattr DW$37, DW_AT_name("IntClockFrequency_UL"), DW_AT_symbol_name("_IntClockFrequency_UL")
     407                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     408                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     409                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1055)
     410                            .dwattr DW$38, DW_AT_name("IntWatchdogTriggerTime_UW"), DW_AT_symbol_name("_IntWatchdogTrigger
     411                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     412                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     413                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1055)
     414                            .dwattr DW$39, DW_AT_name("IntWtdTimerReloadValue_UW"), DW_AT_symbol_name("_IntWtdTimerReloadV
     415                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     416                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     417                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1055)
     418                            .dwattr DW$40, DW_AT_name("HWTimerValue_UW"), DW_AT_symbol_name("_HWTimerValue_UW")
     419                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     420                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     421                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1049)
     422                            .dwattr DW$41, DW_AT_name("OldTimerValue_UL"), DW_AT_symbol_name("_OldTimerValue_UL")
     423                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     424                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     425                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1049)
     426                            .dwattr DW$42, DW_AT_name("TimerTicksForOneMilliSecond_UL"), DW_AT_symbol_name("_TimerTicksFor
     427                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     428                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     429                            .dwendtag DWT$1056
     430                    
     431                    DWT$1019        .dwtag  DW_TAG_typedef, DW_AT_name("tBugfixVersion"), DW_AT_type(*DWT$6)
     432                            .dwattr DWT$1019, DW_AT_language(DW_LANG_C)
     433                    DWT$1020        .dwtag  DW_TAG_typedef, DW_AT_name("tMinorNumber"), DW_AT_type(*DWT$6)
     434                            .dwattr DWT$1020, DW_AT_language(DW_LANG_C)
     435                    DWT$1021        .dwtag  DW_TAG_typedef, DW_AT_name("tMajorNumber"), DW_AT_type(*DWT$6)
     436                            .dwattr DWT$1021, DW_AT_language(DW_LANG_C)
     437                    DWT$1026        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1025)
     438                            .dwattr DWT$1026, DW_AT_address_class(0x20)
     439                    
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE    9

     440                    DWT$1030        .dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1025)
     441                            .dwattr DWT$1030, DW_AT_language(DW_LANG_C)
     442                            .dwattr DWT$1030, DW_AT_byte_size(0x02)
     443                    DW$43   .dwtag  DW_TAG_subrange_type
     444                            .dwattr DW$43, DW_AT_upper_bound(0x01)
     445                            .dwendtag DWT$1030
     446                    
     447                    DWT$1031        .dwtag  DW_TAG_typedef, DW_AT_name("tCommand"), DW_AT_type(*DWT$6)
     448                            .dwattr DWT$1031, DW_AT_language(DW_LANG_C)
     449                    DWT$1032        .dwtag  DW_TAG_typedef, DW_AT_name("tDirection"), DW_AT_type(*DWT$6)
     450                            .dwattr DWT$1032, DW_AT_language(DW_LANG_C)
     451                    DWT$1033        .dwtag  DW_TAG_typedef, DW_AT_name("tFormat"), DW_AT_type(*DWT$6)
     452                            .dwattr DWT$1033, DW_AT_language(DW_LANG_C)
     453                    DWT$1034        .dwtag  DW_TAG_typedef, DW_AT_name("tMilTime"), DW_AT_type(*DWT$6)
     454                            .dwattr DWT$1034, DW_AT_language(DW_LANG_C)
     455                    DWT$8   .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     456                            .dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
     457                            .dwattr DWT$8, DW_AT_byte_size(0x02)
     458                    DWT$1022        .dwtag  DW_TAG_typedef, DW_AT_name("tFlashResult"), DW_AT_type(*DWT$8)
     459                            .dwattr DWT$1022, DW_AT_language(DW_LANG_C)
     460                    DWT$1035        .dwtag  DW_TAG_typedef, DW_AT_name("tSector"), DW_AT_type(*DWT$8)
     461                            .dwattr DWT$1035, DW_AT_language(DW_LANG_C)
     462                    DWT$1055        .dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
     463                            .dwattr DWT$1055, DW_AT_language(DW_LANG_C)
     464                    DWT$12  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     465                            .dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
     466                            .dwattr DWT$12, DW_AT_byte_size(0x04)
     467                    DWT$1023        .dwtag  DW_TAG_typedef, DW_AT_name("tAddress"), DW_AT_type(*DWT$12)
     468                            .dwattr DWT$1023, DW_AT_language(DW_LANG_C)
     469                    DWT$1024        .dwtag  DW_TAG_typedef, DW_AT_name("tLength"), DW_AT_type(*DWT$12)
     470                            .dwattr DWT$1024, DW_AT_language(DW_LANG_C)
     471                    DWT$1036        .dwtag  DW_TAG_typedef, DW_AT_name("t_Delaytime"), DW_AT_type(*DWT$12)
     472                            .dwattr DWT$1036, DW_AT_language(DW_LANG_C)
     473                    DWT$1029        .dwtag  DW_TAG_typedef, DW_AT_name("tWDTriggerFct"), DW_AT_type(*DWT$1028)
     474                            .dwattr DWT$1029, DW_AT_language(DW_LANG_C)
     475                    
     476                    DWT$1043        .dwtag  DW_TAG_structure_type
     477                            .dwattr DWT$1043, DW_AT_byte_size(0x14)
     478                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     479                            .dwattr DW$44, DW_AT_name("ubInterfaceVersion"), DW_AT_symbol_name("_ubInterfaceVersion")
     480                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     481                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     482                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     483                            .dwattr DW$45, DW_AT_name("ubReserverd"), DW_AT_symbol_name("_ubReserverd")
     484                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     485                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     486                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     487                            .dwattr DW$46, DW_AT_name("ubMask"), DW_AT_symbol_name("_ubMask")
     488                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     489                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     490                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
     491                            .dwattr DW$47, DW_AT_name("ubMCU"), DW_AT_symbol_name("_ubMCU")
     492                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     493                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     494                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE   10

     495                            .dwattr DW$48, DW_AT_name("pfnFlashInit"), DW_AT_symbol_name("_pfnFlashInit")
     496                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     497                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     498                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
     499                            .dwattr DW$49, DW_AT_name("pfnFlashDeinit"), DW_AT_symbol_name("_pfnFlashDeinit")
     500                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     501                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     502                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
     503                            .dwattr DW$50, DW_AT_name("pfnFlashErase"), DW_AT_symbol_name("_pfnFlashErase")
     504                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     505                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     506                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
     507                            .dwattr DW$51, DW_AT_name("pfnFlashWrite"), DW_AT_symbol_name("_pfnFlashWrite")
     508                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     509                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     510                            .dwendtag DWT$1043
     511                    
     512                    DWT$1025        .dwtag  DW_TAG_typedef, DW_AT_name("tData"), DW_AT_type(*DWT$6)
     513                            .dwattr DWT$1025, DW_AT_language(DW_LANG_C)
     514                    DWT$1028        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1027)
     515                            .dwattr DWT$1028, DW_AT_address_class(0x20)
     516                    DWT$1042        .dwtag  DW_TAG_typedef, DW_AT_name("tFlashFct"), DW_AT_type(*DWT$1041)
     517                            .dwattr DWT$1042, DW_AT_language(DW_LANG_C)
     518                    
     519                    DWT$1027        .dwtag  DW_TAG_subroutine_type
     520                            .dwattr DWT$1027, DW_AT_language(DW_LANG_C)
     521                    DWT$1041        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1040)
     522                            .dwattr DWT$1041, DW_AT_address_class(0x20)
     523                    
     524                    DWT$1040        .dwtag  DW_TAG_subroutine_type
     525                            .dwattr DWT$1040, DW_AT_language(DW_LANG_C)
     526                    DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1039)
     527                            .dwendtag DWT$1040
     528                    
     529                    DWT$1039        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1038)
     530                            .dwattr DWT$1039, DW_AT_address_class(0x20)
     531                    
     532                            .dwattr DW$5, DW_AT_external(0x01)
     533                            .dwattr DW$5, DW_AT_type(*DWT$1018)
     534                            .dwattr DWCU, DW_AT_language(DW_LANG_C)
     535                    
     536                    ;***************************************************************
     537                    ;* DWARF CIE ENTRIES                                           *
     538                    ;***************************************************************
     539                    
     540                    DW$CIE  .dwcie 1, 26
     541                            .dwcfa  0x0c, 13, 0
     542                            .dwcfa  0x07, 0
     543                            .dwcfa  0x07, 1
     544                            .dwcfa  0x07, 2
     545                            .dwcfa  0x07, 3
     546                            .dwcfa  0x08, 4
     547                            .dwcfa  0x08, 5
     548                            .dwcfa  0x08, 6
     549                            .dwcfa  0x08, 7
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:23 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_FUN_CChal_HISCheck.asm                   PAGE   11

     550                            .dwcfa  0x08, 8
     551                            .dwcfa  0x08, 9
     552                            .dwcfa  0x08, 10
     553                            .dwcfa  0x08, 11
     554                            .dwcfa  0x07, 12
     555                            .dwcfa  0x07, 13
     556                            .dwcfa  0x07, 14
     557                            .dwcfa  0x07, 15
     558                            .dwcfa  0x07, 16
     559                            .dwcfa  0x07, 17
     560                            .dwcfa  0x07, 18
     561                            .dwcfa  0x07, 19
     562                            .dwcfa  0x07, 20
     563                            .dwcfa  0x07, 21
     564                            .dwcfa  0x07, 22
     565                            .dwcfa  0x07, 23
     566                            .dwcfa  0x07, 24
     567                            .dwcfa  0x07, 25
     568                            .dwcfa  0x07, 26
