TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
       3                    ;* Date/Time created: Tue Jan 24 12:32:24 2012                                *
       4                    ;******************************************************************************
       5 00000000                   .state16
       6                    
       7                    DWCU    .dwtag  DW_TAG_compile_unit
       8                            .dwattr DWCU, DW_AT_name("ADLATUS_Hal.c")
       9                            .dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Tex
      10                            .dwattr DWCU, DW_AT_stmt_list(0x00)
      11                            .dwattr DWCU, DW_AT_TI_VERSION(0x01)
      12                    
      13                    DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("FUN_CCtim_SystemTimerCheck_V"), DW_AT_symbol_name("$FUN
      14                            .dwattr DW$1, DW_AT_declaration(0x01)
      15                            .dwattr DW$1, DW_AT_external(0x01)

    1912                            .dwattr DWT$10, DW_AT_byte_size(0x04)
    1913                    DWT$1019        .dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
    1914                            .dwattr DWT$1019, DW_AT_language(DW_LANG_C)
    1915                    DWT$1020        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1019)
    1916                            .dwattr DWT$1020, DW_AT_address_class(0x20)
    1917                    DWT$1050        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1020)
    1918                    
    1919                    DWT$1051        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1019)
    1920                            .dwattr DWT$1051, DW_AT_language(DW_LANG_C)
    1921                    DWT$1052        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1019)
    1922                    
    1923                    DWT$1053        .dwtag  DW_TAG_subroutine_type
    1924                            .dwattr DWT$1053, DW_AT_language(DW_LANG_C)
    1925                    
    1926                    DWT$1061        .dwtag  DW_TAG_subroutine_type
    1927                            .dwattr DWT$1061, DW_AT_language(DW_LANG_C)
    1928                    DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1060)
    1929                            .dwendtag DWT$1061
    1930                    
    1931                    
    1932                    DWT$1062        .dwtag  DW_TAG_subroutine_type
    1933                            .dwattr DWT$1062, DW_AT_language(DW_LANG_C)
    1934                    DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
    1935                    DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1018)
    1936                            .dwendtag DWT$1062
    1937                    
    1938                    
    1939                    DWT$1063        .dwtag  DW_TAG_subroutine_type
    1940                            .dwattr DWT$1063, DW_AT_language(DW_LANG_C)
    1941                    DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
    1942                            .dwendtag DWT$1063
    1943                    
    1944                    DWT$1060        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1059)
    1945                            .dwattr DWT$1060, DW_AT_address_class(0x20)
    1946                    DWT$1064        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1060)
    1947                    DWT$1074        .dwtag  DW_TAG_typedef, DW_AT_name("SARCIM_ST"), DW_AT_type(*DWT$1073)
    1948                            .dwattr DWT$1074, DW_AT_language(DW_LANG_C)
    1949                    DWT$1075        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1073)
    1950                            .dwattr DWT$1075, DW_AT_address_class(0x20)
    1951                    DWT$1078        .dwtag  DW_TAG_typedef, DW_AT_name("SARSYS_ST"), DW_AT_type(*DWT$1077)
    1952                            .dwattr DWT$1078, DW_AT_language(DW_LANG_C)
    1953                    DWT$1081        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1080)
    1954                            .dwattr DWT$1081, DW_AT_address_class(0x20)
    1955                    DWT$1095        .dwtag  DW_TAG_typedef, DW_AT_name("SARRTI_ST"), DW_AT_type(*DWT$1094)
    1956                            .dwattr DWT$1095, DW_AT_language(DW_LANG_C)
    1957                    DWT$1096        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1094)
    1958                            .dwattr DWT$1096, DW_AT_address_class(0x20)
    1959                    DWT$1098        .dwtag  DW_TAG_typedef, DW_AT_name("HALCONTROL_ST"), DW_AT_type(*DWT$1097)
    1960                            .dwattr DWT$1098, DW_AT_language(DW_LANG_C)
    1961                    DWT$1099        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1098)
    1962                            .dwattr DWT$1099, DW_AT_address_class(0x20)
    1963                    DWT$1100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1097)
    1964                            .dwattr DWT$1100, DW_AT_address_class(0x20)
    1965                    DWT$6   .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   37

    1966                            .dwattr DWT$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1967                            .dwattr DWT$6, DW_AT_byte_size(0x01)
    1968                    DWT$1025        .dwtag  DW_TAG_typedef, DW_AT_name("UBYTE"), DW_AT_type(*DWT$6)
    1969                            .dwattr DWT$1025, DW_AT_language(DW_LANG_C)
    1970                    DWT$12  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1971                            .dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
    1972                            .dwattr DWT$12, DW_AT_byte_size(0x04)
    1973                    DWT$1059        .dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1058)
    1974                    DWT$1073        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1072)
    1975                    DWT$1077        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1076)
    1976                    DWT$1080        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1079)
    1977                    DWT$1094        .dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1093)
    1978                    
    1979                    DWT$1097        .dwtag  DW_TAG_structure_type
    1980                            .dwattr DWT$1097, DW_AT_name("_HALCONTROL")
    1981                            .dwattr DWT$1097, DW_AT_byte_size(0x14)
    1982                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
    1983                            .dwattr DW$96, DW_AT_name("IntClockFrequency_UL"), DW_AT_symbol_name("_IntClockFrequency_UL")
    1984                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1985                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1986                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
    1987                            .dwattr DW$97, DW_AT_name("IntWatchdogTriggerTime_UW"), DW_AT_symbol_name("_IntWatchdogTrigger
    1988                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1989                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1990                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
    1991                            .dwattr DW$98, DW_AT_name("IntWtdTimerReloadValue_UW"), DW_AT_symbol_name("_IntWtdTimerReloadV
    1992                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1993                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1994                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
    1995                            .dwattr DW$99, DW_AT_name("HWTimerValue_UW"), DW_AT_symbol_name("_HWTimerValue_UW")
    1996                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1997                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1998                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
    1999                            .dwattr DW$100, DW_AT_name("OldTimerValue_UL"), DW_AT_symbol_name("_OldTimerValue_UL")
    2000                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2001                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2002                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
    2003                            .dwattr DW$101, DW_AT_name("TimerTicksForOneMilliSecond_UL"), DW_AT_symbol_name("_TimerTicksFo
    2004                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2005                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2006                            .dwendtag DWT$1097
    2007                    
    2008                    DWT$1058        .dwtag  DW_TAG_typedef, DW_AT_name("HALINTERFACE_ST"), DW_AT_type(*DWT$1057)
    2009                            .dwattr DWT$1058, DW_AT_language(DW_LANG_C)
    2010                    
    2011                    DWT$1072        .dwtag  DW_TAG_structure_type
    2012                            .dwattr DWT$1072, DW_AT_byte_size(0x18)
    2013                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
    2014                            .dwattr DW$102, DW_AT_name("IrqIVec_UB"), DW_AT_symbol_name("_IrqIVec_UB")
    2015                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2016                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2017                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
    2018                            .dwattr DW$103, DW_AT_name("FiqIVec_UB"), DW_AT_symbol_name("_FiqIVec_UB")
    2019                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2020                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   38

    2021                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
    2022                            .dwattr DW$104, DW_AT_name("CimIVec_UB"), DW_AT_symbol_name("_CimIVec_UB")
    2023                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2024                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2025                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2026                            .dwattr DW$105, DW_AT_name("Firqpr_UL"), DW_AT_symbol_name("_Firqpr_UL")
    2027                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2028                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2029                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2030                            .dwattr DW$106, DW_AT_name("Intreq_UL"), DW_AT_symbol_name("_Intreq_UL")
    2031                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2032                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2033                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2034                            .dwattr DW$107, DW_AT_name("Reqmask_UL"), DW_AT_symbol_name("_Reqmask_UL")
    2035                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2036                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2037                            .dwendtag DWT$1072
    2038                    
    2039                    
    2040                    DWT$1076        .dwtag  DW_TAG_structure_type
    2041                            .dwattr DWT$1076, DW_AT_byte_size(0x30)
    2042                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2043                            .dwattr DW$108, DW_AT_name("ClkCntl_UW"), DW_AT_symbol_name("_ClkCntl_UW")
    2044                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2045                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2046                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2047                            .dwattr DW$109, DW_AT_name("CramCR_UW"), DW_AT_symbol_name("_CramCR_UW")
    2048                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2049                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2050                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2051                            .dwattr DW$110, DW_AT_name("GlbCtrl_UW"), DW_AT_symbol_name("_GlbCtrl_UW")
    2052                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2053                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2054                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2055                            .dwattr DW$111, DW_AT_name("SysECR_UW"), DW_AT_symbol_name("_SysECR_UW")
    2056                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2057                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2058                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2059                            .dwattr DW$112, DW_AT_name("SysESR_UW"), DW_AT_symbol_name("_SysESR_UW")
    2060                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2061                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2062                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2063                            .dwattr DW$113, DW_AT_name("AbrtESR_UW"), DW_AT_symbol_name("_AbrtESR_UW")
    2064                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2065                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2066                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2067                            .dwattr DW$114, DW_AT_name("GlbStat_UW"), DW_AT_symbol_name("_GlbStat_UW")
    2068                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2069                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2070                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2071                            .dwattr DW$115, DW_AT_name("Dev_UW"), DW_AT_symbol_name("_Dev_UW")
    2072                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2073                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2074                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2075                            .dwattr DW$116, DW_AT_name("Ssif_UW"), DW_AT_symbol_name("_Ssif_UW")
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   39

    2076                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2077                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2078                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
    2079                            .dwattr DW$117, DW_AT_name("Ssir_UW"), DW_AT_symbol_name("_Ssir_UW")
    2080                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2081                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2082                            .dwendtag DWT$1076
    2083                    
    2084                    
    2085                    DWT$1079        .dwtag  DW_TAG_structure_type
    2086                            .dwattr DWT$1079, DW_AT_byte_size(0x04)
    2087                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2088                            .dwattr DW$118, DW_AT_name("RTIM_B3"), DW_AT_symbol_name("_RTIM_B3")
    2089                            .dwattr DW$118, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x03)
    2090                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2091                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2092                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2093                            .dwattr DW$119, DW_AT_name("PREDL_B11"), DW_AT_symbol_name("_PREDL_B11")
    2094                            .dwattr DW$119, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
    2095                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2097                            .dwendtag DWT$1079
    2098                    
    2099                    
    2100                    DWT$1093        .dwtag  DW_TAG_structure_type
    2101                            .dwattr DWT$1093, DW_AT_name("rti")
    2102                            .dwattr DWT$1093, DW_AT_byte_size(0x20)
    2103                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1086)
    2104                            .dwattr DW$120, DW_AT_name("DRTICNTR_UN"), DW_AT_symbol_name("_DRTICNTR_UN")
    2105                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2107                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1087)
    2108                            .dwattr DW$121, DW_AT_name("DRTIPCTL_UN"), DW_AT_symbol_name("_DRTIPCTL_UN")
    2109                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2110                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2111                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1089)
    2112                            .dwattr DW$122, DW_AT_name("DRTICNTL_UN"), DW_AT_symbol_name("_DRTICNTL_UN")
    2113                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2114                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2115                    DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2116                            .dwattr DW$123, DW_AT_name("WKEY_UL"), DW_AT_symbol_name("_WKEY_UL")
    2117                            .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2118                            .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2119                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2120                            .dwattr DW$124, DW_AT_name("RTICR1_UL"), DW_AT_symbol_name("_RTICR1_UL")
    2121                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2122                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2123                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2124                            .dwattr DW$125, DW_AT_name("RTICR2_UL"), DW_AT_symbol_name("_RTICR2_UL")
    2125                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2126                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2127                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1091)
    2128                            .dwattr DW$126, DW_AT_name("DRTICINT_UN"), DW_AT_symbol_name("_DRTICINT_UN")
    2129                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2130                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   40

    2131                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1092)
    2132                            .dwattr DW$127, DW_AT_name("DRTICNTEN_UN"), DW_AT_symbol_name("_DRTICNTEN_UN")
    2133                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2134                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2135                            .dwendtag DWT$1093
    2136                    
    2137                    
    2138                    DWT$1057        .dwtag  DW_TAG_structure_type
    2139                            .dwattr DWT$1057, DW_AT_name("_HALINTERFACE")
    2140                            .dwattr DWT$1057, DW_AT_byte_size(0x08)
    2141                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1055)
    2142                            .dwattr DW$128, DW_AT_name("IntClkFrequency_UL"), DW_AT_symbol_name("_IntClkFrequency_UL")
    2143                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2145                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1056)
    2146                            .dwattr DW$129, DW_AT_name("IntWdtTimeout_UW"), DW_AT_symbol_name("_IntWdtTimeout_UW")
    2147                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2148                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwendtag DWT$1057
    2150                    
    2151                    
    2152                    DWT$1086        .dwtag  DW_TAG_union_type
    2153                            .dwattr DWT$1086, DW_AT_byte_size(0x04)
    2154                    DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2155                            .dwattr DW$130, DW_AT_name("DRTICNTR_UL"), DW_AT_symbol_name("_DRTICNTR_UL")
    2156                            .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2157                            .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2158                    DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1085)
    2159                            .dwattr DW$131, DW_AT_name("DRTICNTR_ST"), DW_AT_symbol_name("_DRTICNTR_ST")
    2160                            .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161                            .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2162                            .dwendtag DWT$1086
    2163                    
    2164                    
    2165                    DWT$1087        .dwtag  DW_TAG_union_type
    2166                            .dwattr DWT$1087, DW_AT_byte_size(0x04)
    2167                    DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2168                            .dwattr DW$132, DW_AT_name("DRTIPCTL_UL"), DW_AT_symbol_name("_DRTIPCTL_UL")
    2169                            .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                            .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2171                    DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1079)
    2172                            .dwattr DW$133, DW_AT_name("DRTIPCTL_ST"), DW_AT_symbol_name("_DRTIPCTL_ST")
    2173                            .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174                            .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2175                            .dwendtag DWT$1087
    2176                    
    2177                    
    2178                    DWT$1089        .dwtag  DW_TAG_union_type
    2179                            .dwattr DWT$1089, DW_AT_byte_size(0x04)
    2180                    DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2181                            .dwattr DW$134, DW_AT_name("DRTICNTL_UL"), DW_AT_symbol_name("_DRTICNTL_UL")
    2182                            .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                            .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2184                    DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1088)
    2185                            .dwattr DW$135, DW_AT_name("DRTICNTL_ST"), DW_AT_symbol_name("_DRTICNTL_ST")
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   41

    2186                            .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                            .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2188                            .dwendtag DWT$1089
    2189                    
    2190                    
    2191                    DWT$1091        .dwtag  DW_TAG_union_type
    2192                            .dwattr DWT$1091, DW_AT_byte_size(0x04)
    2193                    DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2194                            .dwattr DW$136, DW_AT_name("DRTICINT_UL"), DW_AT_symbol_name("_DRTICINT_UL")
    2195                            .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2196                            .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2197                    DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1090)
    2198                            .dwattr DW$137, DW_AT_name("DRTICINT_ST"), DW_AT_symbol_name("_DRTICINT_ST")
    2199                            .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                            .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwendtag DWT$1091
    2202                    
    2203                    
    2204                    DWT$1092        .dwtag  DW_TAG_union_type
    2205                            .dwattr DWT$1092, DW_AT_byte_size(0x04)
    2206                    DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
    2207                            .dwattr DW$138, DW_AT_name("DRTICNTEN_UL"), DW_AT_symbol_name("_DRTICNTEN_UL")
    2208                            .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                            .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2210                    DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DWT$1082)
    2211                            .dwattr DW$139, DW_AT_name("DRTICNTEN_ST"), DW_AT_symbol_name("_DRTICNTEN_ST")
    2212                            .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                            .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2214                            .dwendtag DWT$1092
    2215                    
    2216                    DWT$1056        .dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_UWORD"), DW_AT_type(*DWT$1022)
    2217                            .dwattr DWT$1056, DW_AT_language(DW_LANG_C)
    2218                    DWT$1055        .dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_ULONG"), DW_AT_type(*DWT$1020)
    2219                            .dwattr DWT$1055, DW_AT_language(DW_LANG_C)
    2220                    
    2221                    DWT$1082        .dwtag  DW_TAG_structure_type
    2222                            .dwattr DWT$1082, DW_AT_byte_size(0x04)
    2223                    DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2224                            .dwattr DW$140, DW_AT_name("CNTEN_B2"), DW_AT_symbol_name("_CNTEN_B2")
    2225                            .dwattr DW$140, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2226                            .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                            .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2228                            .dwendtag DWT$1082
    2229                    
    2230                    
    2231                    DWT$1085        .dwtag  DW_TAG_structure_type
    2232                            .dwattr DWT$1085, DW_AT_byte_size(0x04)
    2233                    DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2234                            .dwattr DW$141, DW_AT_name("DRTICNTR_B21"), DW_AT_symbol_name("_DRTICNTR_B21")
    2235                            .dwattr DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x15)
    2236                            .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                            .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2238                    DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2239                            .dwattr DW$142, DW_AT_name("DRTIMOD_B11"), DW_AT_symbol_name("_DRTIMOD_B11")
    2240                            .dwattr DW$142, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   42

    2241                            .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                            .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2243                            .dwendtag DWT$1085
    2244                    
    2245                    
    2246                    DWT$1088        .dwtag  DW_TAG_structure_type
    2247                            .dwattr DWT$1088, DW_AT_byte_size(0x04)
    2248                    DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2249                            .dwattr DW$143, DW_AT_name("RTIF_B1"), DW_AT_symbol_name("_RTIF_B1")
    2250                            .dwattr DW$143, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    2251                            .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                            .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2253                    DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2254                            .dwattr DW$144, DW_AT_name("RTIE_B1"), DW_AT_symbol_name("_RTIE_B1")
    2255                            .dwattr DW$144, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    2256                            .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                            .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2258                            .dwendtag DWT$1088
    2259                    
    2260                    
    2261                    DWT$1090        .dwtag  DW_TAG_structure_type
    2262                            .dwattr DWT$1090, DW_AT_byte_size(0x04)
    2263                    DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2264                            .dwattr DW$145, DW_AT_name("CF1_B1"), DW_AT_symbol_name("_CF1_B1")
    2265                            .dwattr DW$145, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    2266                            .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                            .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2268                    DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2269                            .dwattr DW$146, DW_AT_name("CF2_B1"), DW_AT_symbol_name("_CF2_B1")
    2270                            .dwattr DW$146, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    2271                            .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                            .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2273                    DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2274                            .dwattr DW$147, DW_AT_name("CE1_B1"), DW_AT_symbol_name("_CE1_B1")
    2275                            .dwattr DW$147, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    2276                            .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                            .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2278                    DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
    2279                            .dwattr DW$148, DW_AT_name("CR2_B1"), DW_AT_symbol_name("_CR2_B1")
    2280                            .dwattr DW$148, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    2281                            .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                            .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2283                            .dwendtag DWT$1090
    2284                    
    2285                    
    2286                            .dwattr DW$22, DW_AT_external(0x01)
    2287                            .dwattr DW$46, DW_AT_external(0x01)
    2288                            .dwattr DW$48, DW_AT_external(0x01)
    2289                            .dwattr DW$30, DW_AT_external(0x01)
    2290                            .dwattr DW$30, DW_AT_type(*DWT$1021)
    2291                            .dwattr DW$54, DW_AT_external(0x01)
    2292                            .dwattr DW$54, DW_AT_type(*DWT$1019)
    2293                            .dwattr DW$51, DW_AT_external(0x01)
    2294                            .dwattr DW$51, DW_AT_type(*DWT$1019)
    2295                            .dwattr DW$12, DW_AT_external(0x01)
TMS470 COFF Assembler PC Version 2.71 Tue Jan 24 12:32:24 2012

Tools Copyright (c) 1996-2008 Texas Instruments Incorporated
r:/06_hallib/04_lst/ADLATUS_Hal.asm                                  PAGE   43

    2296                            .dwattr DW$26, DW_AT_external(0x01)
    2297                            .dwattr DW$43, DW_AT_external(0x01)
    2298                            .dwattr DW$39, DW_AT_external(0x01)
    2299                            .dwattr DW$36, DW_AT_external(0x01)
    2300                            .dwattr DW$77, DW_AT_external(0x01)
    2301                            .dwattr DW$77, DW_AT_type(*DWT$1018)
    2302                            .dwattr DW$73, DW_AT_external(0x01)
    2303                            .dwattr DW$56, DW_AT_external(0x01)
    2304                            .dwattr DWCU, DW_AT_language(DW_LANG_C)
    2305                    
    2306                    ;***************************************************************
    2307                    ;* DWARF CIE ENTRIES                                           *
    2308                    ;***************************************************************
    2309                    
    2310                    DW$CIE  .dwcie 1, 26
    2311                            .dwcfa  0x0c, 13, 0
    2312                            .dwcfa  0x07, 0
    2313                            .dwcfa  0x07, 1
    2314                            .dwcfa  0x07, 2
    2315                            .dwcfa  0x07, 3
    2316                            .dwcfa  0x08, 4
    2317                            .dwcfa  0x08, 5
    2318                            .dwcfa  0x08, 6
    2319                            .dwcfa  0x08, 7
    2320                            .dwcfa  0x08, 8
    2321                            .dwcfa  0x08, 9
    2322                            .dwcfa  0x08, 10
    2323                            .dwcfa  0x08, 11
    2324                            .dwcfa  0x07, 12
    2325                            .dwcfa  0x07, 13
    2326                            .dwcfa  0x07, 14
    2327                            .dwcfa  0x07, 15
    2328                            .dwcfa  0x07, 16
    2329                            .dwcfa  0x07, 17
    2330                            .dwcfa  0x07, 18
    2331                            .dwcfa  0x07, 19
    2332                            .dwcfa  0x07, 20
    2333                            .dwcfa  0x07, 21
    2334                            .dwcfa  0x07, 22
    2335                            .dwcfa  0x07, 23
    2336                            .dwcfa  0x07, 24
    2337                            .dwcfa  0x07, 25
    2338                            .dwcfa  0x07, 26
    2339                    
    2340                    ;***************************************************************
    2341                    ;* DWARF REGISTER MAP                                          *
