;******************************************************************************
;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
;* Date/Time created: Tue Jan 24 12:32:41 2012                                *
;******************************************************************************
	.state16

DWCU	.dwtag  DW_TAG_compile_unit
	.dwattr DWCU, DW_AT_name("lld_SPI.c")
	.dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr DWCU, DW_AT_stmt_list(0x00)
	.dwattr DWCU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("FUN_CCtim_SystemTimerCheck_V"), DW_AT_symbol_name("$FUN_CCtim_SystemTimerCheck_V")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_variable, DW_AT_name("e_SPI2_ST"), DW_AT_symbol_name("_e_SPI2_ST")
	.dwattr DW$2, DW_AT_type(*DWT$1135)
	.dwattr DW$2, DW_AT_declaration(0x01)
	.dwattr DW$2, DW_AT_external(0x01)

	.sect	".const"
	.align	2
_SPI2_st_EepromMode:
	.field  	360,16			; _SPI2_st_EepromMode._uw_Ctrl1 @ 0
	.field  	57,16			; _SPI2_st_EepromMode._uw_Ctrl2 @ 16
	.field  	0,16			; _SPI2_st_EepromMode._uw_Ctrl3 @ 32

	.sect	".text"
	.global	_SPI2_st_EepromMode
DW$3	.dwtag  DW_TAG_variable, DW_AT_name("SPI2_st_EepromMode"), DW_AT_symbol_name("_SPI2_st_EepromMode")
	.dwattr DW$3, DW_AT_type(*DWT$1032)
	.dwattr DW$3, DW_AT_location[DW_OP_addr _SPI2_st_EepromMode]

	.dwattr DW$72, DW_AT_begin_file("lld_SPI.c")
	.dwattr DW$72, DW_AT_begin_line(0x130)
	.dwattr DW$72, DW_AT_end_line(0x13f)
DW$73	.dwtag  DW_TAG_loop_range
	.dwattr DW$73, DW_AT_low_pc(DWL$$OCSPI_WriteSync$3$B)
	.dwattr DW$73, DW_AT_high_pc(DWL$$OCSPI_WriteSync$3$E)
DW$74	.dwtag  DW_TAG_loop_range
	.dwattr DW$74, DW_AT_low_pc(DWL$$OCSPI_WriteSync$6$B)
	.dwattr DW$74, DW_AT_high_pc(DWL$$OCSPI_WriteSync$6$E)

DW$75	.dwtag  DW_TAG_loop
	.dwattr DW$75, DW_AT_name("r:/01_adlatus/04_lst/lld_SPI.asm:L18:2:1327404761")
	.dwattr DW$75, DW_AT_begin_file("lld_SPI.c")
	.dwattr DW$75, DW_AT_begin_line(0x138)
	.dwattr DW$75, DW_AT_end_line(0x13a)
DW$76	.dwtag  DW_TAG_loop_range
	.dwattr DW$76, DW_AT_low_pc(DWL$$OCSPI_WriteSync$5$B)
	.dwattr DW$76, DW_AT_high_pc(DWL$$OCSPI_WriteSync$5$E)
DW$77	.dwtag  DW_TAG_loop_range
	.dwattr DW$77, DW_AT_low_pc(DWL$$OCSPI_WriteSync$4$B)
	.dwattr DW$77, DW_AT_high_pc(DWL$$OCSPI_WriteSync$4$E)
	.dwendtag DW$75

	.dwendtag DW$72

	.dwendentry
	.dwendtag DW$59



;; Inlined function references:
;; [  1] SPI_v_SetMode
;******************************************************************************
;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text"
	.align	4
CON1:	.field  	_e_SPI2_ST,32
	.align	4
CON3:	.field  	65533,32
	.align	4
CON4:	.field  	_SPI2_st_Pins,32
	.align	4
CON5:	.field  	_SPI2_st_EepromMode,32
	.align	4
CON7:	.field  	_g_buf_UB,32
	.align	4
CON8:	.field  	$FUN_CCtim_SystemTimerCheck_V+1,32
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	$FUN_CCtim_SystemTimerCheck_V
	.global	_e_SPI2_ST

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************
DWT$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DWT$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DWT$6, DW_AT_byte_size(0x01)
DWT$1018	.dwtag  DW_TAG_typedef, DW_AT_name("T_U8"), DW_AT_type(*DWT$6)
	.dwattr DWT$1018, DW_AT_language(DW_LANG_C)
DWT$1019	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1019, DW_AT_address_class(0x20)
DWT$1020	.dwtag  DW_TAG_typedef, DW_AT_name("OCSPI_MemPtrType"), DW_AT_type(*DWT$1019)
	.dwattr DWT$1020, DW_AT_language(DW_LANG_C)
DWT$1021	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$6)
	.dwattr DWT$1021, DW_AT_address_class(0x20)
DWT$1023	.dwtag  DW_TAG_typedef, DW_AT_name("IO_ChannelType"), DW_AT_type(*DWT$8)
	.dwattr DWT$1023, DW_AT_language(DW_LANG_C)
DWT$1025	.dwtag  DW_TAG_typedef, DW_AT_name("OCSPI_SizeType"), DW_AT_type(*DWT$1024)
	.dwattr DWT$1025, DW_AT_language(DW_LANG_C)
DWT$11	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DWT$11, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$11, DW_AT_byte_size(0x04)

DWT$1028	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1028, DW_AT_language(DW_LANG_C)

DWT$1034	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1034, DW_AT_language(DW_LANG_C)
DW$78	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1033)
	.dwendtag DWT$1034

DWT$1037	.dwtag  DW_TAG_typedef, DW_AT_name("OCSPI_ConfigType"), DW_AT_type(*DWT$1036)
	.dwattr DWT$1037, DW_AT_language(DW_LANG_C)
DWT$1032	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1031)
DWT$1033	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1032)
	.dwattr DWT$1033, DW_AT_address_class(0x20)
DWT$1039	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1038)
	.dwattr DWT$1039, DW_AT_address_class(0x20)

DWT$1042	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1042, DW_AT_language(DW_LANG_C)
DW$79	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1037)
	.dwendtag DWT$1042


DWT$1043	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1043, DW_AT_language(DW_LANG_C)

DWT$1044	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1041)
	.dwattr DWT$1044, DW_AT_language(DW_LANG_C)
DW$80	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
DW$81	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$82	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1025)
	.dwendtag DWT$1044

DWT$1135	.dwtag  DW_TAG_typedef, DW_AT_name("SPI_ST"), DW_AT_type(*DWT$1134)
	.dwattr DWT$1135, DW_AT_language(DW_LANG_C)
DWT$1136	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1135)
	.dwattr DWT$1136, DW_AT_address_class(0x20)
DWT$1137	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1134)
	.dwattr DWT$1137, DW_AT_address_class(0x20)
DWT$1140	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1139)
DWT$1142	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1141)
	.dwattr DWT$1142, DW_AT_address_class(0x20)
DWT$8	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$8, DW_AT_byte_size(0x02)
DWT$1024	.dwtag  DW_TAG_typedef, DW_AT_name("T_U16"), DW_AT_type(*DWT$8)
	.dwattr DWT$1024, DW_AT_language(DW_LANG_C)
DWT$1036	.dwtag  DW_TAG_pointer_type
	.dwattr DWT$1036, DW_AT_address_class(0x20)
DWT$1031	.dwtag  DW_TAG_typedef, DW_AT_name("tSpiMode"), DW_AT_type(*DWT$1030)
	.dwattr DWT$1031, DW_AT_language(DW_LANG_C)
DWT$1038	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1030)
DWT$1041	.dwtag  DW_TAG_typedef, DW_AT_name("IO_ErrorType"), DW_AT_type(*DWT$1040)
	.dwattr DWT$1041, DW_AT_language(DW_LANG_C)
DWT$1134	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1133)
DWT$1139	.dwtag  DW_TAG_typedef, DW_AT_name("tSpiPins"), DW_AT_type(*DWT$1138)
	.dwattr DWT$1139, DW_AT_language(DW_LANG_C)
DWT$1141	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1138)

DWT$1030	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1030, DW_AT_name("st_Mode")
	.dwattr DWT$1030, DW_AT_byte_size(0x06)
DW$83	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$83, DW_AT_name("uw_Ctrl1"), DW_AT_symbol_name("_uw_Ctrl1")
	.dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
DW$84	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$84, DW_AT_name("uw_Ctrl2"), DW_AT_symbol_name("_uw_Ctrl2")
	.dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
DW$85	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$85, DW_AT_name("uw_Ctrl3"), DW_AT_symbol_name("_uw_Ctrl3")
	.dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1030


DWT$1040	.dwtag  DW_TAG_enumeration_type
	.dwattr DWT$1040, DW_AT_byte_size(0x04)
DW$86	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_OK"), DW_AT_const_value(0x00)
DW$87	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_PARAM_IGNORED"), DW_AT_const_value(0x01)
DW$88	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_BUSY"), DW_AT_const_value(0x02)
DW$89	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_UNKNOWN_MODE"), DW_AT_const_value(0x03)
DW$90	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_CHANNEL_ID"), DW_AT_const_value(0x04)
DW$91	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_MISSING_INIT"), DW_AT_const_value(0x05)
DW$92	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_VALUE"), DW_AT_const_value(0x06)
DW$93	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_SIZE"), DW_AT_const_value(0x07)
DW$94	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_POSITION"), DW_AT_const_value(0x08)
DW$95	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_NOTIF_TYPE"), DW_AT_const_value(0x09)
DW$96	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_ROMVERSION"), DW_AT_const_value(0x0a)
DW$97	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_TYPE_MISMATCH"), DW_AT_const_value(0x0b)
DW$98	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_FCN_SUSPENDED"), DW_AT_const_value(0x0c)
DW$99	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_FAILURE"), DW_AT_const_value(0x0d)
DW$100	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_LOCKED"), DW_AT_const_value(0x0e)
DW$101	.dwtag  DW_TAG_enumerator, DW_AT_name("IO_E_INVALID_MODE"), DW_AT_const_value(0x0f)
	.dwendtag DWT$1040


DWT$1133	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1133, DW_AT_name("spi_st")
	.dwattr DWT$1133, DW_AT_byte_size(0x34)
DW$102	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$102, DW_AT_name("ctrl1_UN"), DW_AT_symbol_name("_ctrl1_UN")
	.dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
DW$103	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1068)
	.dwattr DW$103, DW_AT_name("ctrl2_UN"), DW_AT_symbol_name("_ctrl2_UN")
	.dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
DW$104	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1087)
	.dwattr DW$104, DW_AT_name("ctrl3_UN"), DW_AT_symbol_name("_ctrl3_UN")
	.dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
DW$105	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$105, DW_AT_name("uw_Dat0"), DW_AT_symbol_name("_uw_Dat0")
	.dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
DW$106	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$106, DW_AT_name("uw_Dat1"), DW_AT_symbol_name("_uw_Dat1")
	.dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
DW$107	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$107, DW_AT_name("uw_Img_Reg"), DW_AT_symbol_name("_uw_Img_Reg")
	.dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
DW$108	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$108, DW_AT_name("uw_Buf"), DW_AT_symbol_name("_uw_Buf")
	.dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
DW$109	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$109, DW_AT_name("uw_Emu"), DW_AT_symbol_name("_uw_Emu")
	.dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
DW$110	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1100)
	.dwattr DW$110, DW_AT_name("pc1_UN"), DW_AT_symbol_name("_pc1_UN")
	.dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
DW$111	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1132)
	.dwattr DW$111, DW_AT_name("pc2_UN"), DW_AT_symbol_name("_pc2_UN")
	.dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
DW$112	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1105)
	.dwattr DW$112, DW_AT_name("pc3_UN"), DW_AT_symbol_name("_pc3_UN")
	.dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
DW$113	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1112)
	.dwattr DW$113, DW_AT_name("pc4_UN"), DW_AT_symbol_name("_pc4_UN")
	.dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
DW$114	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1121)
	.dwattr DW$114, DW_AT_name("pc5_UN"), DW_AT_symbol_name("_pc5_UN")
	.dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
DW$115	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1128)
	.dwattr DW$115, DW_AT_name("pc6_UN"), DW_AT_symbol_name("_pc6_UN")
	.dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1133


DWT$1138	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1138, DW_AT_name("st_SPI_Pins")
	.dwattr DWT$1138, DW_AT_byte_size(0x06)
DW$116	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$116, DW_AT_name("uw_PC1"), DW_AT_symbol_name("_uw_PC1")
	.dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
DW$117	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$117, DW_AT_name("uw_PC3"), DW_AT_symbol_name("_uw_PC3")
	.dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
DW$118	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1022)
	.dwattr DW$118, DW_AT_name("uw_PC6"), DW_AT_symbol_name("_uw_PC6")
	.dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1138

DWT$1022	.dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
	.dwattr DWT$1022, DW_AT_language(DW_LANG_C)

DWT$1054	.dwtag  DW_TAG_union_type
	.dwattr DWT$1054, DW_AT_name("spi_ctrl1")
	.dwattr DWT$1054, DW_AT_byte_size(0x04)
DW$119	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1048)
	.dwattr DW$119, DW_AT_name("ctrl1_UW"), DW_AT_symbol_name("_ctrl1_UW")
	.dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
DW$120	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1053)
	.dwattr DW$120, DW_AT_name("ctrl1_ST"), DW_AT_symbol_name("_ctrl1_ST")
	.dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1054


DWT$1068	.dwtag  DW_TAG_union_type
	.dwattr DWT$1068, DW_AT_name("spi_ctrl2")
	.dwattr DWT$1068, DW_AT_byte_size(0x04)
DW$121	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1059)
	.dwattr DW$121, DW_AT_name("ctrl2_UW"), DW_AT_symbol_name("_ctrl2_UW")
	.dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
DW$122	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1067)
	.dwattr DW$122, DW_AT_name("ctrl2_ST"), DW_AT_symbol_name("_ctrl2_ST")
	.dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1068


DWT$1087	.dwtag  DW_TAG_union_type
	.dwattr DWT$1087, DW_AT_name("spi_ctrl3")
	.dwattr DWT$1087, DW_AT_byte_size(0x04)
DW$123	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1076)
	.dwattr DW$123, DW_AT_name("ctrl3_UW"), DW_AT_symbol_name("_ctrl3_UW")
	.dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
DW$124	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1086)
	.dwattr DW$124, DW_AT_name("ctrl3_ST"), DW_AT_symbol_name("_ctrl3_ST")
	.dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1087


DWT$1100	.dwtag  DW_TAG_union_type
	.dwattr DWT$1100, DW_AT_byte_size(0x04)
DW$125	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1097)
	.dwattr DW$125, DW_AT_name("pc1_UW"), DW_AT_symbol_name("_pc1_UW")
	.dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
DW$126	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1099)
	.dwattr DW$126, DW_AT_name("pc1_ST"), DW_AT_symbol_name("_pc1_ST")
	.dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1100


DWT$1105	.dwtag  DW_TAG_union_type
	.dwattr DWT$1105, DW_AT_byte_size(0x04)
DW$127	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1102)
	.dwattr DW$127, DW_AT_name("pc3_UW"), DW_AT_symbol_name("_pc3_UW")
	.dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
DW$128	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1104)
	.dwattr DW$128, DW_AT_name("pc3_ST"), DW_AT_symbol_name("_pc3_ST")
	.dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1105


DWT$1112	.dwtag  DW_TAG_union_type
	.dwattr DWT$1112, DW_AT_byte_size(0x04)
DW$129	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1107)
	.dwattr DW$129, DW_AT_name("pc4_UW"), DW_AT_symbol_name("_pc4_UW")
	.dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
DW$130	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1111)
	.dwattr DW$130, DW_AT_name("pc4_ST"), DW_AT_symbol_name("_pc4_ST")
	.dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1112


DWT$1121	.dwtag  DW_TAG_union_type
	.dwattr DWT$1121, DW_AT_byte_size(0x04)
DW$131	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1116)
	.dwattr DW$131, DW_AT_name("pc5_UW"), DW_AT_symbol_name("_pc5_UW")
	.dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
DW$132	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1120)
	.dwattr DW$132, DW_AT_name("pc5_ST"), DW_AT_symbol_name("_pc5_ST")
	.dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1121


DWT$1128	.dwtag  DW_TAG_union_type
	.dwattr DWT$1128, DW_AT_byte_size(0x04)
DW$133	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1125)
	.dwattr DW$133, DW_AT_name("pc6_UW"), DW_AT_symbol_name("_pc6_UW")
	.dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
DW$134	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1127)
	.dwattr DW$134, DW_AT_name("pc6_ST"), DW_AT_symbol_name("_pc6_ST")
	.dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1128


DWT$1132	.dwtag  DW_TAG_union_type
	.dwattr DWT$1132, DW_AT_byte_size(0x04)
DW$135	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1130)
	.dwattr DW$135, DW_AT_name("pc2_UW"), DW_AT_symbol_name("_pc2_UW")
	.dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
DW$136	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1131)
	.dwattr DW$136, DW_AT_name("pc2_ST"), DW_AT_symbol_name("_pc2_ST")
	.dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1132


DWT$1048	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1048, DW_AT_byte_size(0x04)
DW$137	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$137, DW_AT_name("uw_Ctrl1"), DW_AT_symbol_name("_uw_Ctrl1")
	.dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1048


DWT$1053	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1053, DW_AT_byte_size(0x04)
DW$138	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$138, DW_AT_name("TapSel_B8"), DW_AT_symbol_name("_TapSel_B8")
	.dwattr DW$138, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x08)
	.dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
DW$139	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$139, DW_AT_name("CharLen_B5"), DW_AT_symbol_name("_CharLen_B5")
	.dwattr DW$139, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x05)
	.dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1053


DWT$1059	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1059, DW_AT_byte_size(0x04)
DW$140	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$140, DW_AT_name("uw_Ctrl2"), DW_AT_symbol_name("_uw_Ctrl2")
	.dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1059


DWT$1067	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1067, DW_AT_byte_size(0x04)
DW$141	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$141, DW_AT_name("ClkMod_B1"), DW_AT_symbol_name("_ClkMod_B1")
	.dwattr DW$141, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
DW$142	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$142, DW_AT_name("SpiEN_B1"), DW_AT_symbol_name("_SpiEN_B1")
	.dwattr DW$142, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
DW$143	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$143, DW_AT_name("Master_B1"), DW_AT_symbol_name("_Master_B1")
	.dwattr DW$143, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
DW$144	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$144, DW_AT_name("PowerDown_B1"), DW_AT_symbol_name("_PowerDown_B1")
	.dwattr DW$144, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
DW$145	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$145, DW_AT_name("Polarity_B1"), DW_AT_symbol_name("_Polarity_B1")
	.dwattr DW$145, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
DW$146	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$146, DW_AT_name("Phase_B1"), DW_AT_symbol_name("_Phase_B1")
	.dwattr DW$146, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1067


DWT$1076	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1076, DW_AT_byte_size(0x04)
DW$147	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$147, DW_AT_name("uw_Ctrl3"), DW_AT_symbol_name("_uw_Ctrl3")
	.dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1076


DWT$1086	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1086, DW_AT_byte_size(0x04)
DW$148	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$148, DW_AT_name("TriStateEN_B1"), DW_AT_symbol_name("_TriStateEN_B1")
	.dwattr DW$148, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
DW$149	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$149, DW_AT_name("DmaReqEN_B1"), DW_AT_symbol_name("_DmaReqEN_B1")
	.dwattr DW$149, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
DW$150	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$150, DW_AT_name("OvrnIntEN_B1"), DW_AT_symbol_name("_OvrnIntEN_B1")
	.dwattr DW$150, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
DW$151	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$151, DW_AT_name("RcvrOvrn_B1"), DW_AT_symbol_name("_RcvrOvrn_B1")
	.dwattr DW$151, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
DW$152	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$152, DW_AT_name("IntEN_B1"), DW_AT_symbol_name("_IntEN_B1")
	.dwattr DW$152, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
DW$153	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$153, DW_AT_name("IntFlag_B1"), DW_AT_symbol_name("_IntFlag_B1")
	.dwattr DW$153, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1086


DWT$1097	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1097, DW_AT_byte_size(0x04)
DW$154	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$154, DW_AT_name("uw_PC1"), DW_AT_symbol_name("_uw_PC1")
	.dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1097


DWT$1099	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1099, DW_AT_byte_size(0x04)
DW$155	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$155, DW_AT_name("SCSDir_B1"), DW_AT_symbol_name("_SCSDir_B1")
	.dwattr DW$155, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
DW$156	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$156, DW_AT_name("SOMIDir_B1"), DW_AT_symbol_name("_SOMIDir_B1")
	.dwattr DW$156, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
DW$157	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$157, DW_AT_name("SIMODir_B1"), DW_AT_symbol_name("_SIMODir_B1")
	.dwattr DW$157, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
DW$158	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$158, DW_AT_name("ClkDir_B1"), DW_AT_symbol_name("_ClkDir_B1")
	.dwattr DW$158, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
DW$159	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$159, DW_AT_name("EnableDir_B1"), DW_AT_symbol_name("_EnableDir_B1")
	.dwattr DW$159, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1099


DWT$1102	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1102, DW_AT_byte_size(0x04)
DW$160	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$160, DW_AT_name("uw_PC3"), DW_AT_symbol_name("_uw_PC3")
	.dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1102


DWT$1104	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1104, DW_AT_byte_size(0x04)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$161, DW_AT_name("SCSDout_B1"), DW_AT_symbol_name("_SCSDout_B1")
	.dwattr DW$161, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
DW$162	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$162, DW_AT_name("SOMIDout_B1"), DW_AT_symbol_name("_SOMIDout_B1")
	.dwattr DW$162, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$163, DW_AT_name("SIMODout_B1"), DW_AT_symbol_name("_SIMODout_B1")
	.dwattr DW$163, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$164, DW_AT_name("ClkDout_B1"), DW_AT_symbol_name("_ClkDout_B1")
	.dwattr DW$164, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
DW$165	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$165, DW_AT_name("EnableDout_B1"), DW_AT_symbol_name("_EnableDout_B1")
	.dwattr DW$165, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1104


DWT$1107	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1107, DW_AT_byte_size(0x04)
DW$166	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$166, DW_AT_name("uw_PC4"), DW_AT_symbol_name("_uw_PC4")
	.dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1107


DWT$1111	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1111, DW_AT_byte_size(0x04)
DW$167	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$167, DW_AT_name("SCSDoutSet_B1"), DW_AT_symbol_name("_SCSDoutSet_B1")
	.dwattr DW$167, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
DW$168	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$168, DW_AT_name("SOMIDoutSet_B1"), DW_AT_symbol_name("_SOMIDoutSet_B1")
	.dwattr DW$168, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
DW$169	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$169, DW_AT_name("SIMODoutSet_B1"), DW_AT_symbol_name("_SIMODoutSet_B1")
	.dwattr DW$169, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
DW$170	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$170, DW_AT_name("ClkDoutSet_B1"), DW_AT_symbol_name("_ClkDoutSet_B1")
	.dwattr DW$170, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
DW$171	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$171, DW_AT_name("EnableDoutSet_B1"), DW_AT_symbol_name("_EnableDoutSet_B1")
	.dwattr DW$171, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1111


DWT$1116	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1116, DW_AT_byte_size(0x04)
DW$172	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$172, DW_AT_name("uw_PC5"), DW_AT_symbol_name("_uw_PC5")
	.dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1116


DWT$1120	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1120, DW_AT_byte_size(0x04)
DW$173	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$173, DW_AT_name("SCSDoutClr_B1"), DW_AT_symbol_name("_SCSDoutClr_B1")
	.dwattr DW$173, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
DW$174	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$174, DW_AT_name("SOMIDoutClr_B1"), DW_AT_symbol_name("_SOMIDoutClr_B1")
	.dwattr DW$174, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
DW$175	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$175, DW_AT_name("SIMODoutClr_B1"), DW_AT_symbol_name("_SIMODoutClr_B1")
	.dwattr DW$175, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
DW$176	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$176, DW_AT_name("ClkDoutClr_B1"), DW_AT_symbol_name("_ClkDoutClr_B1")
	.dwattr DW$176, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
DW$177	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$177, DW_AT_name("EnableDoutClr_B1"), DW_AT_symbol_name("_EnableDoutClr_B1")
	.dwattr DW$177, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1120


DWT$1125	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1125, DW_AT_byte_size(0x04)
DW$178	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$178, DW_AT_name("uw_PC6"), DW_AT_symbol_name("_uw_PC6")
	.dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1125


DWT$1127	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1127, DW_AT_byte_size(0x04)
DW$179	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$179, DW_AT_name("SCSFun_B1"), DW_AT_symbol_name("_SCSFun_B1")
	.dwattr DW$179, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
DW$180	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$180, DW_AT_name("SOMIFun_B1"), DW_AT_symbol_name("_SOMIFun_B1")
	.dwattr DW$180, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
DW$181	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$181, DW_AT_name("SIMOFun_B1"), DW_AT_symbol_name("_SIMOFun_B1")
	.dwattr DW$181, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
DW$182	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$182, DW_AT_name("ClkFun_B1"), DW_AT_symbol_name("_ClkFun_B1")
	.dwattr DW$182, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
DW$183	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$183, DW_AT_name("EnableFun_B1"), DW_AT_symbol_name("_EnableFun_B1")
	.dwattr DW$183, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1127


DWT$1130	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1130, DW_AT_byte_size(0x04)
DW$184	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$184, DW_AT_name("uw_PC2"), DW_AT_symbol_name("_uw_PC2")
	.dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1130


DWT$1131	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1131, DW_AT_byte_size(0x04)
DW$185	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$185, DW_AT_name("SCSDin_B1"), DW_AT_symbol_name("_SCSDin_B1")
	.dwattr DW$185, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
DW$186	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$186, DW_AT_name("SOMIDin_B1"), DW_AT_symbol_name("_SOMIDin_B1")
	.dwattr DW$186, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
DW$187	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$187, DW_AT_name("SIMODin_B1"), DW_AT_symbol_name("_SIMODin_B1")
	.dwattr DW$187, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
DW$188	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$188, DW_AT_name("ClkDin_B1"), DW_AT_symbol_name("_ClkDin_B1")
	.dwattr DW$188, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
DW$189	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$189, DW_AT_name("EnableDin_B1"), DW_AT_symbol_name("_EnableDin_B1")
	.dwattr DW$189, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1131

DWT$10	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$10, DW_AT_byte_size(0x04)

	.dwattr DW$15, DW_AT_external(0x01)
	.dwattr DW$15, DW_AT_type(*DWT$1041)
	.dwattr DW$13, DW_AT_external(0x01)
	.dwattr DW$7, DW_AT_external(0x01)
	.dwattr DW$7, DW_AT_type(*DWT$1041)
	.dwattr DW$30, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_type(*DWT$1041)
	.dwattr DW$59, DW_AT_external(0x01)
	.dwattr DW$59, DW_AT_type(*DWT$1041)
	.dwattr DWCU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 26
	.dwcfa	0x0c, 13, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x08, 4
	.dwcfa	0x08, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$190	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$190, DW_AT_location[DW_OP_reg0]
DW$191	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$191, DW_AT_location[DW_OP_reg1]
DW$192	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$192, DW_AT_location[DW_OP_reg2]
DW$193	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$193, DW_AT_location[DW_OP_reg3]
DW$194	.dwtag  DW_TAG_assign_register, DW_AT_name("V1")
	.dwattr DW$194, DW_AT_location[DW_OP_reg4]
DW$195	.dwtag  DW_TAG_assign_register, DW_AT_name("V2")
	.dwattr DW$195, DW_AT_location[DW_OP_reg5]
DW$196	.dwtag  DW_TAG_assign_register, DW_AT_name("V3")
	.dwattr DW$196, DW_AT_location[DW_OP_reg6]
DW$197	.dwtag  DW_TAG_assign_register, DW_AT_name("V4")
	.dwattr DW$197, DW_AT_location[DW_OP_reg7]
DW$198	.dwtag  DW_TAG_assign_register, DW_AT_name("V5")
	.dwattr DW$198, DW_AT_location[DW_OP_reg8]
DW$199	.dwtag  DW_TAG_assign_register, DW_AT_name("V6")
	.dwattr DW$199, DW_AT_location[DW_OP_reg9]
DW$200	.dwtag  DW_TAG_assign_register, DW_AT_name("V7")
	.dwattr DW$200, DW_AT_location[DW_OP_reg10]
DW$201	.dwtag  DW_TAG_assign_register, DW_AT_name("V8")
	.dwattr DW$201, DW_AT_location[DW_OP_reg11]
DW$202	.dwtag  DW_TAG_assign_register, DW_AT_name("V9")
	.dwattr DW$202, DW_AT_location[DW_OP_reg12]
DW$203	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$203, DW_AT_location[DW_OP_reg13]
DW$204	.dwtag  DW_TAG_assign_register, DW_AT_name("LR")
	.dwattr DW$204, DW_AT_location[DW_OP_reg14]
DW$205	.dwtag  DW_TAG_assign_register, DW_AT_name("PC")
	.dwattr DW$205, DW_AT_location[DW_OP_reg15]
DW$206	.dwtag  DW_TAG_assign_register, DW_AT_name("C0")
	.dwattr DW$206, DW_AT_location[DW_OP_reg16]
DW$207	.dwtag  DW_TAG_assign_register, DW_AT_name("C1")
	.dwattr DW$207, DW_AT_location[DW_OP_reg17]
DW$208	.dwtag  DW_TAG_assign_register, DW_AT_name("C2")
	.dwattr DW$208, DW_AT_location[DW_OP_reg18]
DW$209	.dwtag  DW_TAG_assign_register, DW_AT_name("C3")
	.dwattr DW$209, DW_AT_location[DW_OP_reg19]
DW$210	.dwtag  DW_TAG_assign_register, DW_AT_name("C4")
	.dwattr DW$210, DW_AT_location[DW_OP_reg20]
DW$211	.dwtag  DW_TAG_assign_register, DW_AT_name("C5")
	.dwattr DW$211, DW_AT_location[DW_OP_reg21]
DW$212	.dwtag  DW_TAG_assign_register, DW_AT_name("C6")
	.dwattr DW$212, DW_AT_location[DW_OP_reg22]
DW$213	.dwtag  DW_TAG_assign_register, DW_AT_name("C7")
	.dwattr DW$213, DW_AT_location[DW_OP_reg23]
