;******************************************************************************
;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
;* Date/Time created: Fri Dec 09 08:43:05 2011                                *
;******************************************************************************
	.state16

DWCU	.dwtag  DW_TAG_compile_unit
	.dwattr DWCU, DW_AT_name("FlashLib_TMS470.c")
	.dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr DWCU, DW_AT_stmt_list(0x00)
	.dwattr DWCU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("Flash_Start_Command_B"), DW_AT_symbol_name("$Flash_Start_Command_B")
	.dwattr DW$1, DW_AT_type(*DWT$1018)
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$3	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$4	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$5	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
DW$6	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1024)
DW$7	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1024)
	.dwendtag DW$1


DW$8	.dwtag  DW_TAG_subprogram, DW_AT_name("Flash_Prog_Data_B"), DW_AT_symbol_name("$Flash_Prog_Data_B")
	.dwattr DW$8, DW_AT_type(*DWT$1018)
	.dwattr DW$8, DW_AT_declaration(0x01)
	.dwattr DW$8, DW_AT_external(0x01)
DW$9	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)

	.dwattr DWT$6, DW_AT_byte_size(0x01)
DWT$1018	.dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DWT$6)
	.dwattr DWT$1018, DW_AT_language(DW_LANG_C)

DWT$1025	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1025, DW_AT_language(DW_LANG_C)
DW$115	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$116	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$117	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$118	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
DW$119	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1024)
DW$120	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1024)
	.dwendtag DWT$1025


DWT$1029	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1029, DW_AT_language(DW_LANG_C)
DW$121	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$122	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$123	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$124	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$125	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$126	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
DW$127	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1028)
DW$128	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$129	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1024)
	.dwendtag DWT$1029

DWT$1030	.dwtag  DW_TAG_typedef, DW_AT_name("UBYTE"), DW_AT_type(*DWT$6)
	.dwattr DWT$1030, DW_AT_language(DW_LANG_C)

DWT$1053	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1030)
	.dwattr DWT$1053, DW_AT_language(DW_LANG_C)
DW$130	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1052)
	.dwendtag DWT$1053

DWT$1060	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$6)
	.dwattr DWT$1060, DW_AT_address_class(0x20)
DWT$8	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$8, DW_AT_byte_size(0x02)
DWT$1024	.dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
	.dwattr DWT$1024, DW_AT_language(DW_LANG_C)

DWT$1062	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1024)
	.dwattr DWT$1062, DW_AT_language(DW_LANG_C)
DW$131	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
	.dwendtag DWT$1062


DWT$1063	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1024)
	.dwattr DWT$1063, DW_AT_language(DW_LANG_C)
DW$132	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
DW$133	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1019)
	.dwendtag DWT$1063

DWT$11	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DWT$11, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$11, DW_AT_byte_size(0x04)

DWT$1069	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$11)
	.dwattr DWT$1069, DW_AT_language(DW_LANG_C)
DWT$10	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$10, DW_AT_byte_size(0x04)
DWT$1019	.dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
	.dwattr DWT$1019, DW_AT_language(DW_LANG_C)
DWT$1020	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1019)
	.dwattr DWT$1020, DW_AT_address_class(0x20)
DWT$1021	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1019)
DWT$1023	.dwtag  DW_TAG_typedef, DW_AT_name("FLASH_ARRAY_ST"), DW_AT_type(*DWT$1022)
	.dwattr DWT$1023, DW_AT_language(DW_LANG_C)
DWT$1078	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1023)
DWT$1079	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1019)
DWT$1035	.dwtag  DW_TAG_typedef, DW_AT_name("tAddress"), DW_AT_type(*DWT$12)
	.dwattr DWT$1035, DW_AT_language(DW_LANG_C)

DWT$1039	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1039, DW_AT_language(DW_LANG_C)

DWT$1081	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1081, DW_AT_language(DW_LANG_C)
DW$134	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1080)
	.dwendtag DWT$1081

DWT$1027	.dwtag  DW_TAG_typedef, DW_AT_name("FLASH_STATUS_ST"), DW_AT_type(*DWT$1026)
	.dwattr DWT$1027, DW_AT_language(DW_LANG_C)
DWT$1028	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1027)
	.dwattr DWT$1028, DW_AT_address_class(0x20)
DWT$1052	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1051)
	.dwattr DWT$1052, DW_AT_address_class(0x20)
DWT$1084	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1052)
DWT$1080	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1050)
	.dwattr DWT$1080, DW_AT_address_class(0x20)
DWT$1085	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1080)
DWT$1086	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1049)
	.dwattr DWT$1086, DW_AT_address_class(0x20)
DWT$1107	.dwtag  DW_TAG_typedef, DW_AT_name("SARRTI_ST"), DW_AT_type(*DWT$1106)
	.dwattr DWT$1107, DW_AT_language(DW_LANG_C)
DWT$1108	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1106)
	.dwattr DWT$1108, DW_AT_address_class(0x20)
DWT$1112	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1111)

DWT$1117	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1116)
	.dwattr DWT$1117, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1117, DW_AT_byte_size(0x84)
DW$135	.dwtag  DW_TAG_subrange_type
	.dwattr DW$135, DW_AT_upper_bound(0x0a)
	.dwendtag DWT$1117

DWT$1122	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1121)
	.dwattr DWT$1122, DW_AT_address_class(0x20)
DWT$1124	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1123)
	.dwattr DWT$1124, DW_AT_address_class(0x20)
DWT$1126	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1125)
	.dwattr DWT$1126, DW_AT_address_class(0x20)
DWT$1128	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1127)
	.dwattr DWT$1128, DW_AT_address_class(0x20)
DWT$1130	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1129)
	.dwattr DWT$1130, DW_AT_address_class(0x20)
DWT$12	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$12, DW_AT_byte_size(0x04)
DWT$1022	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1021)
	.dwattr DWT$1022, DW_AT_address_class(0x20)

DWT$1026	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1026, DW_AT_name("_FLASH_STATUS_ST")
	.dwattr DWT$1026, DW_AT_byte_size(0x10)
DW$136	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$136, DW_AT_name("stat1"), DW_AT_symbol_name("_stat1")
	.dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
DW$137	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$137, DW_AT_name("stat2"), DW_AT_symbol_name("_stat2")
	.dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
DW$138	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$138, DW_AT_name("stat3"), DW_AT_symbol_name("_stat3")
	.dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
DW$139	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$139, DW_AT_name("stat4"), DW_AT_symbol_name("_stat4")
	.dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1026


DWT$1049	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1049, DW_AT_byte_size(0x30)
DW$140	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1031)
	.dwattr DW$140, DW_AT_name("patchlevel"), DW_AT_symbol_name("_patchlevel")
	.dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
DW$141	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1032)
	.dwattr DW$141, DW_AT_name("minornumber"), DW_AT_symbol_name("_minornumber")
	.dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
DW$142	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1033)
	.dwattr DW$142, DW_AT_name("majornumber"), DW_AT_symbol_name("_majornumber")
	.dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
DW$143	.dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
	.dwattr DW$143, DW_AT_name("reserved1"), DW_AT_symbol_name("_reserved1")
	.dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
DW$144	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1034)
	.dwattr DW$144, DW_AT_name("errorcode"), DW_AT_symbol_name("_errorcode")
	.dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
DW$145	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$145, DW_AT_name("reserved2"), DW_AT_symbol_name("_reserved2")
	.dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
DW$146	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
	.dwattr DW$146, DW_AT_name("address"), DW_AT_symbol_name("_address")
	.dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
DW$147	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1036)
	.dwattr DW$147, DW_AT_name("length"), DW_AT_symbol_name("_length")
	.dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
DW$148	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1038)
	.dwattr DW$148, DW_AT_name("data"), DW_AT_symbol_name("_data")
	.dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
DW$149	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1041)
	.dwattr DW$149, DW_AT_name("wdTriggerFct"), DW_AT_symbol_name("_wdTriggerFct")
	.dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
DW$150	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
	.dwattr DW$150, DW_AT_name("intendedData"), DW_AT_symbol_name("_intendedData")
	.dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
DW$151	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1042)
	.dwattr DW$151, DW_AT_name("actualData"), DW_AT_symbol_name("_actualData")
	.dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
DW$152	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1035)
	.dwattr DW$152, DW_AT_name("errorAddress"), DW_AT_symbol_name("_errorAddress")
	.dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
DW$153	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1043)
	.dwattr DW$153, DW_AT_name("Command_UB"), DW_AT_symbol_name("_Command_UB")
	.dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
DW$154	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$154, DW_AT_name("Direction_UB"), DW_AT_symbol_name("_Direction_UB")
	.dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
DW$155	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1045)
	.dwattr DW$155, DW_AT_name("Format_UB"), DW_AT_symbol_name("_Format_UB")
	.dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
DW$156	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1046)
	.dwattr DW$156, DW_AT_name("Millisec_UB"), DW_AT_symbol_name("_Millisec_UB")
	.dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
DW$157	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1047)
	.dwattr DW$157, DW_AT_name("StartSector_US"), DW_AT_symbol_name("_StartSector_US")
	.dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
DW$158	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1047)
	.dwattr DW$158, DW_AT_name("EndSector_US"), DW_AT_symbol_name("_EndSector_US")
	.dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
DW$159	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1047)
	.dwattr DW$159, DW_AT_name("NbrOfSectors_US"), DW_AT_symbol_name("_NbrOfSectors_US")
	.dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
DW$160	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1047)
	.dwattr DW$160, DW_AT_name("ActualSector_US"), DW_AT_symbol_name("_ActualSector_US")
	.dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1048)
	.dwattr DW$161, DW_AT_name("Delaytime_UL"), DW_AT_symbol_name("_Delaytime_UL")
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1049

DWT$1050	.dwtag  DW_TAG_typedef, DW_AT_name("tFlashParam"), DW_AT_type(*DWT$1049)
	.dwattr DWT$1050, DW_AT_language(DW_LANG_C)
DWT$1051	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1050)
DWT$1106	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1105)
DWT$1111	.dwtag  DW_TAG_typedef, DW_AT_name("tHis_Header"), DW_AT_type(*DWT$1110)
	.dwattr DWT$1111, DW_AT_language(DW_LANG_C)
DWT$1116	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1115)
DWT$1121	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1114)
DWT$1123	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1114)
DWT$1125	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1114)
DWT$1127	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1114)
DWT$1129	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1114)
DWT$1031	.dwtag  DW_TAG_typedef, DW_AT_name("tBugfixVersion"), DW_AT_type(*DWT$6)
	.dwattr DWT$1031, DW_AT_language(DW_LANG_C)
DWT$1032	.dwtag  DW_TAG_typedef, DW_AT_name("tMinorNumber"), DW_AT_type(*DWT$6)
	.dwattr DWT$1032, DW_AT_language(DW_LANG_C)
DWT$1033	.dwtag  DW_TAG_typedef, DW_AT_name("tMajorNumber"), DW_AT_type(*DWT$6)
	.dwattr DWT$1033, DW_AT_language(DW_LANG_C)
DWT$1038	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1037)
	.dwattr DWT$1038, DW_AT_address_class(0x20)

DWT$1042	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1037)
	.dwattr DWT$1042, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1042, DW_AT_byte_size(0x02)
DW$162	.dwtag  DW_TAG_subrange_type
	.dwattr DW$162, DW_AT_upper_bound(0x01)
	.dwendtag DWT$1042

DWT$1043	.dwtag  DW_TAG_typedef, DW_AT_name("tCommand"), DW_AT_type(*DWT$6)
	.dwattr DWT$1043, DW_AT_language(DW_LANG_C)
DWT$1044	.dwtag  DW_TAG_typedef, DW_AT_name("tDirection"), DW_AT_type(*DWT$6)
	.dwattr DWT$1044, DW_AT_language(DW_LANG_C)
DWT$1045	.dwtag  DW_TAG_typedef, DW_AT_name("tFormat"), DW_AT_type(*DWT$6)
	.dwattr DWT$1045, DW_AT_language(DW_LANG_C)
DWT$1046	.dwtag  DW_TAG_typedef, DW_AT_name("tMilTime"), DW_AT_type(*DWT$6)
	.dwattr DWT$1046, DW_AT_language(DW_LANG_C)
DWT$1034	.dwtag  DW_TAG_typedef, DW_AT_name("tFlashResult"), DW_AT_type(*DWT$8)
	.dwattr DWT$1034, DW_AT_language(DW_LANG_C)
DWT$1047	.dwtag  DW_TAG_typedef, DW_AT_name("tSector"), DW_AT_type(*DWT$8)
	.dwattr DWT$1047, DW_AT_language(DW_LANG_C)
DWT$1036	.dwtag  DW_TAG_typedef, DW_AT_name("tLength"), DW_AT_type(*DWT$12)
	.dwattr DWT$1036, DW_AT_language(DW_LANG_C)
DWT$1048	.dwtag  DW_TAG_typedef, DW_AT_name("t_Delaytime"), DW_AT_type(*DWT$12)
	.dwattr DWT$1048, DW_AT_language(DW_LANG_C)
DWT$1041	.dwtag  DW_TAG_typedef, DW_AT_name("tWDTriggerFct"), DW_AT_type(*DWT$1040)
	.dwattr DWT$1041, DW_AT_language(DW_LANG_C)

DWT$1105	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1105, DW_AT_name("rti")
	.dwattr DWT$1105, DW_AT_byte_size(0x20)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1096)
	.dwattr DW$163, DW_AT_name("DRTICNTR_UN"), DW_AT_symbol_name("_DRTICNTR_UN")
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1098)
	.dwattr DW$164, DW_AT_name("DRTIPCTL_UN"), DW_AT_symbol_name("_DRTIPCTL_UN")
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
DW$165	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1100)
	.dwattr DW$165, DW_AT_name("DRTICNTL_UN"), DW_AT_symbol_name("_DRTICNTL_UN")
	.dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
DW$166	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$166, DW_AT_name("WKEY_UL"), DW_AT_symbol_name("_WKEY_UL")
	.dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
DW$167	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$167, DW_AT_name("RTICR1_UL"), DW_AT_symbol_name("_RTICR1_UL")
	.dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
DW$168	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$168, DW_AT_name("RTICR2_UL"), DW_AT_symbol_name("_RTICR2_UL")
	.dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
DW$169	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1102)
	.dwattr DW$169, DW_AT_name("DRTICINT_UN"), DW_AT_symbol_name("_DRTICINT_UN")
	.dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
DW$170	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1104)
	.dwattr DW$170, DW_AT_name("DRTICNTEN_UN"), DW_AT_symbol_name("_DRTICNTEN_UN")
	.dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1105


DWT$1110	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1110, DW_AT_byte_size(0x14)
DW$171	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$171, DW_AT_name("ubInterfaceVersion"), DW_AT_symbol_name("_ubInterfaceVersion")
	.dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
DW$172	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$172, DW_AT_name("ubReserverd"), DW_AT_symbol_name("_ubReserverd")
	.dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
DW$173	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$173, DW_AT_name("ubMask"), DW_AT_symbol_name("_ubMask")
	.dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
DW$174	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$174, DW_AT_name("ubMCU"), DW_AT_symbol_name("_ubMCU")
	.dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
DW$175	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1109)
	.dwattr DW$175, DW_AT_name("pfnFlashInit"), DW_AT_symbol_name("_pfnFlashInit")
	.dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
DW$176	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1109)
	.dwattr DW$176, DW_AT_name("pfnFlashDeinit"), DW_AT_symbol_name("_pfnFlashDeinit")
	.dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
DW$177	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1109)
	.dwattr DW$177, DW_AT_name("pfnFlashErase"), DW_AT_symbol_name("_pfnFlashErase")
	.dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
DW$178	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1109)
	.dwattr DW$178, DW_AT_name("pfnFlashWrite"), DW_AT_symbol_name("_pfnFlashWrite")
	.dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1110


DWT$1114	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1114, DW_AT_name("_FLASH")
	.dwattr DWT$1114, DW_AT_byte_size(0x0c)
DW$179	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$179, DW_AT_name("Start_UL"), DW_AT_symbol_name("_Start_UL")
	.dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
DW$180	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$180, DW_AT_name("Length_UL"), DW_AT_symbol_name("_Length_UL")
	.dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
DW$181	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1024)
	.dwattr DW$181, DW_AT_name("Sector_UW"), DW_AT_symbol_name("_Sector_UW")
	.dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
DW$182	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$182, DW_AT_name("Core_UB"), DW_AT_symbol_name("_Core_UB")
	.dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
DW$183	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$183, DW_AT_name("FlashType_UB"), DW_AT_symbol_name("_FlashType_UB")
	.dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1114

DWT$1115	.dwtag  DW_TAG_typedef, DW_AT_name("FLASH_ST"), DW_AT_type(*DWT$1114)
	.dwattr DWT$1115, DW_AT_language(DW_LANG_C)
DWT$1037	.dwtag  DW_TAG_typedef, DW_AT_name("tData"), DW_AT_type(*DWT$6)
	.dwattr DWT$1037, DW_AT_language(DW_LANG_C)
DWT$1040	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1039)
	.dwattr DWT$1040, DW_AT_address_class(0x20)
DWT$1109	.dwtag  DW_TAG_typedef, DW_AT_name("tFlashFct"), DW_AT_type(*DWT$1082)
	.dwattr DWT$1109, DW_AT_language(DW_LANG_C)

DWT$1096	.dwtag  DW_TAG_union_type
	.dwattr DWT$1096, DW_AT_byte_size(0x04)
DW$184	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$184, DW_AT_name("DRTICNTR_UL"), DW_AT_symbol_name("_DRTICNTR_UL")
	.dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
DW$185	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1095)
	.dwattr DW$185, DW_AT_name("DRTICNTR_ST"), DW_AT_symbol_name("_DRTICNTR_ST")
	.dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1096


DWT$1098	.dwtag  DW_TAG_union_type
	.dwattr DWT$1098, DW_AT_byte_size(0x04)
DW$186	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$186, DW_AT_name("DRTIPCTL_UL"), DW_AT_symbol_name("_DRTIPCTL_UL")
	.dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
DW$187	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1097)
	.dwattr DW$187, DW_AT_name("DRTIPCTL_ST"), DW_AT_symbol_name("_DRTIPCTL_ST")
	.dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1098


DWT$1100	.dwtag  DW_TAG_union_type
	.dwattr DWT$1100, DW_AT_byte_size(0x04)
DW$188	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$188, DW_AT_name("DRTICNTL_UL"), DW_AT_symbol_name("_DRTICNTL_UL")
	.dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
DW$189	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1099)
	.dwattr DW$189, DW_AT_name("DRTICNTL_ST"), DW_AT_symbol_name("_DRTICNTL_ST")
	.dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1100


DWT$1102	.dwtag  DW_TAG_union_type
	.dwattr DWT$1102, DW_AT_byte_size(0x04)
DW$190	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$190, DW_AT_name("DRTICINT_UL"), DW_AT_symbol_name("_DRTICINT_UL")
	.dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
DW$191	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1101)
	.dwattr DW$191, DW_AT_name("DRTICINT_ST"), DW_AT_symbol_name("_DRTICINT_ST")
	.dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1102


DWT$1104	.dwtag  DW_TAG_union_type
	.dwattr DWT$1104, DW_AT_byte_size(0x04)
DW$192	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$192, DW_AT_name("DRTICNTEN_UL"), DW_AT_symbol_name("_DRTICNTEN_UL")
	.dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
DW$193	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1103)
	.dwattr DW$193, DW_AT_name("DRTICNTEN_ST"), DW_AT_symbol_name("_DRTICNTEN_ST")
	.dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1104

DWT$1082	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1081)
	.dwattr DWT$1082, DW_AT_address_class(0x20)

DWT$1095	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1095, DW_AT_byte_size(0x04)
DW$194	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$194, DW_AT_name("DRTICNTR_B21"), DW_AT_symbol_name("_DRTICNTR_B21")
	.dwattr DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x15)
	.dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
DW$195	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$195, DW_AT_name("DRTIMOD_B11"), DW_AT_symbol_name("_DRTIMOD_B11")
	.dwattr DW$195, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
	.dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1095


DWT$1097	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1097, DW_AT_byte_size(0x04)
DW$196	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$196, DW_AT_name("RTIM_B3"), DW_AT_symbol_name("_RTIM_B3")
	.dwattr DW$196, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x03)
	.dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
DW$197	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$197, DW_AT_name("PREDL_B11"), DW_AT_symbol_name("_PREDL_B11")
	.dwattr DW$197, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
	.dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1097


DWT$1099	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1099, DW_AT_byte_size(0x04)
DW$198	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$198, DW_AT_name("RTIF_B1"), DW_AT_symbol_name("_RTIF_B1")
	.dwattr DW$198, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
DW$199	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$199, DW_AT_name("RTIE_B1"), DW_AT_symbol_name("_RTIE_B1")
	.dwattr DW$199, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1099


DWT$1101	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1101, DW_AT_byte_size(0x04)
DW$200	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$200, DW_AT_name("CF1_B1"), DW_AT_symbol_name("_CF1_B1")
	.dwattr DW$200, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
DW$201	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$201, DW_AT_name("CF2_B1"), DW_AT_symbol_name("_CF2_B1")
	.dwattr DW$201, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
DW$202	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$202, DW_AT_name("CE1_B1"), DW_AT_symbol_name("_CE1_B1")
	.dwattr DW$202, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
DW$203	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$203, DW_AT_name("CR2_B1"), DW_AT_symbol_name("_CR2_B1")
	.dwattr DW$203, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1101


DWT$1103	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1103, DW_AT_byte_size(0x04)
DW$204	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$204, DW_AT_name("CNTEN_B2"), DW_AT_symbol_name("_CNTEN_B2")
	.dwattr DW$204, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
	.dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1103


	.dwattr DW$112, DW_AT_external(0x01)
	.dwattr DW$33, DW_AT_external(0x01)
	.dwattr DW$41, DW_AT_external(0x01)
	.dwattr DW$49, DW_AT_external(0x01)
	.dwattr DW$49, DW_AT_type(*DWT$1030)
	.dwattr DW$25, DW_AT_external(0x01)
	.dwattr DW$66, DW_AT_external(0x01)
	.dwattr DW$89, DW_AT_external(0x01)
	.dwattr DW$89, DW_AT_type(*DWT$1024)
	.dwattr DW$100, DW_AT_external(0x01)
	.dwattr DW$100, DW_AT_type(*DWT$1024)
	.dwattr DWCU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 26
	.dwcfa	0x0c, 13, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x08, 4
	.dwcfa	0x08, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$205	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$205, DW_AT_location[DW_OP_reg0]
DW$206	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$206, DW_AT_location[DW_OP_reg1]
DW$207	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$207, DW_AT_location[DW_OP_reg2]
DW$208	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$208, DW_AT_location[DW_OP_reg3]
DW$209	.dwtag  DW_TAG_assign_register, DW_AT_name("V1")
	.dwattr DW$209, DW_AT_location[DW_OP_reg4]
DW$210	.dwtag  DW_TAG_assign_register, DW_AT_name("V2")
	.dwattr DW$210, DW_AT_location[DW_OP_reg5]
DW$211	.dwtag  DW_TAG_assign_register, DW_AT_name("V3")
	.dwattr DW$211, DW_AT_location[DW_OP_reg6]
DW$212	.dwtag  DW_TAG_assign_register, DW_AT_name("V4")
	.dwattr DW$212, DW_AT_location[DW_OP_reg7]
DW$213	.dwtag  DW_TAG_assign_register, DW_AT_name("V5")
	.dwattr DW$213, DW_AT_location[DW_OP_reg8]
DW$214	.dwtag  DW_TAG_assign_register, DW_AT_name("V6")
	.dwattr DW$214, DW_AT_location[DW_OP_reg9]
DW$215	.dwtag  DW_TAG_assign_register, DW_AT_name("V7")
	.dwattr DW$215, DW_AT_location[DW_OP_reg10]
DW$216	.dwtag  DW_TAG_assign_register, DW_AT_name("V8")
	.dwattr DW$216, DW_AT_location[DW_OP_reg11]
DW$217	.dwtag  DW_TAG_assign_register, DW_AT_name("V9")
	.dwattr DW$217, DW_AT_location[DW_OP_reg12]
DW$218	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$218, DW_AT_location[DW_OP_reg13]
DW$219	.dwtag  DW_TAG_assign_register, DW_AT_name("LR")
	.dwattr DW$219, DW_AT_location[DW_OP_reg14]
DW$220	.dwtag  DW_TAG_assign_register, DW_AT_name("PC")
	.dwattr DW$220, DW_AT_location[DW_OP_reg15]
DW$221	.dwtag  DW_TAG_assign_register, DW_AT_name("C0")
	.dwattr DW$221, DW_AT_location[DW_OP_reg16]
DW$222	.dwtag  DW_TAG_assign_register, DW_AT_name("C1")
	.dwattr DW$222, DW_AT_location[DW_OP_reg17]
DW$223	.dwtag  DW_TAG_assign_register, DW_AT_name("C2")
	.dwattr DW$223, DW_AT_location[DW_OP_reg18]
DW$224	.dwtag  DW_TAG_assign_register, DW_AT_name("C3")
	.dwattr DW$224, DW_AT_location[DW_OP_reg19]
DW$225	.dwtag  DW_TAG_assign_register, DW_AT_name("C4")
	.dwattr DW$225, DW_AT_location[DW_OP_reg20]
DW$226	.dwtag  DW_TAG_assign_register, DW_AT_name("C5")
	.dwattr DW$226, DW_AT_location[DW_OP_reg21]
DW$227	.dwtag  DW_TAG_assign_register, DW_AT_name("C6")
	.dwattr DW$227, DW_AT_location[DW_OP_reg22]
DW$228	.dwtag  DW_TAG_assign_register, DW_AT_name("C7")
	.dwattr DW$228, DW_AT_location[DW_OP_reg23]
DW$229	.dwtag  DW_TAG_assign_register, DW_AT_name("AP")
	.dwattr DW$229, DW_AT_location[DW_OP_reg24]
