;******************************************************************************
;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
;* Date/Time created: Tue Jan 24 12:32:24 2012                                *
;******************************************************************************
	.state16

DWCU	.dwtag  DW_TAG_compile_unit
	.dwattr DWCU, DW_AT_name("ADLATUS_Hal.c")
	.dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr DWCU, DW_AT_stmt_list(0x00)
	.dwattr DWCU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("FUN_CCtim_SystemTimerCheck_V"), DW_AT_symbol_name("$FUN_CCtim_SystemTimerCheck_V")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_variable, DW_AT_name("RAMHAL"), DW_AT_symbol_name("_RAMHAL")
	.dwattr DW$2, DW_AT_type(*DWT$1052)
	.dwattr DW$2, DW_AT_declaration(0x01)
	.dwattr DW$2, DW_AT_external(0x01)
DW$3	.dwtag  DW_TAG_variable, DW_AT_name("ROMHAL"), DW_AT_symbol_name("_ROMHAL")
	.dwattr DW$3, DW_AT_type(*DWT$1052)
	.dwattr DW$3, DW_AT_declaration(0x01)
	.dwattr DW$3, DW_AT_external(0x01)
DW$4	.dwtag  DW_TAG_variable, DW_AT_name("e_SARCIM_ST"), DW_AT_symbol_name("_e_SARCIM_ST")
	.dwattr DW$4, DW_AT_type(*DWT$1074)
	.dwattr DW$4, DW_AT_declaration(0x01)
	.dwattr DW$4, DW_AT_external(0x01)
DW$5	.dwtag  DW_TAG_variable, DW_AT_name("e_SARSYS_ST"), DW_AT_symbol_name("_e_SARSYS_ST")

;* CONSTANT TABLE                                                             *
;******************************************************************************
	.sect	".text"
	.align	4
CON1:	.field  	_t_CChal_HalCtrl_ST,32
	.align	4
CON2:	.field  	_ROMHAL,32
	.align	4
CON3:	.field  	_RAMHAL,32
	.align	4
CON4:	.field  	_e_SARCIM_ST,32
	.align	4
CON5:	.field  	_c_CCconprj_ClockFrequency_UL,32
	.align	4
CON7:	.field  	_e_SARRTI_ST,32
	.align	4
CON9:	.field  	_c_CCconprj_DisableReset_UB,32
	.align	4
CON10:	.field  	_e_SARSYS_ST+18,32
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	$FUN_CCtim_SystemTimerCheck_V
	.global	_RAMHAL
	.global	_ROMHAL
	.global	_e_SARCIM_ST
	.global	_e_SARSYS_ST
	.global	_e_SARRTI_ST
	.global	_c_CCconprj_ClockFrequency_UL
	.global	_c_CCconprj_DisableReset_UB
	.global	U$DIV

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************
DWT$1018	.dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DWT$6)
	.dwattr DWT$1018, DW_AT_language(DW_LANG_C)

DWT$1023	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1023, DW_AT_language(DW_LANG_C)
DW$90	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
DW$91	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1022)
	.dwendtag DWT$1023

DWT$1024	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1018)
DWT$1026	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1025)
DWT$1027	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1025)
	.dwattr DWT$1027, DW_AT_address_class(0x20)
DWT$8	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$8, DW_AT_byte_size(0x02)
DWT$1021	.dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
	.dwattr DWT$1021, DW_AT_language(DW_LANG_C)
DWT$1022	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1021)
	.dwattr DWT$1022, DW_AT_address_class(0x20)
DWT$1033	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1022)

DWT$1034	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1021)
	.dwattr DWT$1034, DW_AT_language(DW_LANG_C)
DWT$1035	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1021)
DWT$11	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DWT$11, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$11, DW_AT_byte_size(0x04)
DWT$10	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$10, DW_AT_byte_size(0x04)
DWT$1019	.dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
	.dwattr DWT$1019, DW_AT_language(DW_LANG_C)
DWT$1020	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1019)
	.dwattr DWT$1020, DW_AT_address_class(0x20)
DWT$1050	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1020)

DWT$1051	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DWT$1019)
	.dwattr DWT$1051, DW_AT_language(DW_LANG_C)
DWT$1052	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1019)

DWT$1053	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1053, DW_AT_language(DW_LANG_C)

DWT$1061	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1061, DW_AT_language(DW_LANG_C)
DW$92	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1060)
	.dwendtag DWT$1061


DWT$1062	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1062, DW_AT_language(DW_LANG_C)
DW$93	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1021)
DW$94	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1018)
	.dwendtag DWT$1062


DWT$1063	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1063, DW_AT_language(DW_LANG_C)
DW$95	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1020)
	.dwendtag DWT$1063

DWT$1060	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1059)
	.dwattr DWT$1060, DW_AT_address_class(0x20)
DWT$1064	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1060)
DWT$1074	.dwtag  DW_TAG_typedef, DW_AT_name("SARCIM_ST"), DW_AT_type(*DWT$1073)
	.dwattr DWT$1074, DW_AT_language(DW_LANG_C)
DWT$1075	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1073)
	.dwattr DWT$1075, DW_AT_address_class(0x20)
DWT$1078	.dwtag  DW_TAG_typedef, DW_AT_name("SARSYS_ST"), DW_AT_type(*DWT$1077)
	.dwattr DWT$1078, DW_AT_language(DW_LANG_C)
DWT$1081	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1080)
	.dwattr DWT$1081, DW_AT_address_class(0x20)
DWT$1095	.dwtag  DW_TAG_typedef, DW_AT_name("SARRTI_ST"), DW_AT_type(*DWT$1094)
	.dwattr DWT$1095, DW_AT_language(DW_LANG_C)
DWT$1096	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1094)
	.dwattr DWT$1096, DW_AT_address_class(0x20)
DWT$1098	.dwtag  DW_TAG_typedef, DW_AT_name("HALCONTROL_ST"), DW_AT_type(*DWT$1097)
	.dwattr DWT$1098, DW_AT_language(DW_LANG_C)
DWT$1099	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1098)
	.dwattr DWT$1099, DW_AT_address_class(0x20)
DWT$1100	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1097)
	.dwattr DWT$1100, DW_AT_address_class(0x20)
DWT$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DWT$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DWT$6, DW_AT_byte_size(0x01)
DWT$1025	.dwtag  DW_TAG_typedef, DW_AT_name("UBYTE"), DW_AT_type(*DWT$6)
	.dwattr DWT$1025, DW_AT_language(DW_LANG_C)
DWT$12	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$12, DW_AT_byte_size(0x04)
DWT$1059	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1058)
DWT$1073	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1072)
DWT$1077	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1076)
DWT$1080	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1079)
DWT$1094	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1093)

DWT$1097	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1097, DW_AT_name("_HALCONTROL")
	.dwattr DWT$1097, DW_AT_byte_size(0x14)
DW$96	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$96, DW_AT_name("IntClockFrequency_UL"), DW_AT_symbol_name("_IntClockFrequency_UL")
	.dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
DW$97	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
	.dwattr DW$97, DW_AT_name("IntWatchdogTriggerTime_UW"), DW_AT_symbol_name("_IntWatchdogTriggerTime_UW")
	.dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
DW$98	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
	.dwattr DW$98, DW_AT_name("IntWtdTimerReloadValue_UW"), DW_AT_symbol_name("_IntWtdTimerReloadValue_UW")
	.dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
DW$99	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1021)
	.dwattr DW$99, DW_AT_name("HWTimerValue_UW"), DW_AT_symbol_name("_HWTimerValue_UW")
	.dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
DW$100	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$100, DW_AT_name("OldTimerValue_UL"), DW_AT_symbol_name("_OldTimerValue_UL")
	.dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
DW$101	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1019)
	.dwattr DW$101, DW_AT_name("TimerTicksForOneMilliSecond_UL"), DW_AT_symbol_name("_TimerTicksForOneMilliSecond_UL")
	.dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1097

DWT$1058	.dwtag  DW_TAG_typedef, DW_AT_name("HALINTERFACE_ST"), DW_AT_type(*DWT$1057)
	.dwattr DWT$1058, DW_AT_language(DW_LANG_C)

DWT$1072	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1072, DW_AT_byte_size(0x18)
DW$102	.dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
	.dwattr DW$102, DW_AT_name("IrqIVec_UB"), DW_AT_symbol_name("_IrqIVec_UB")
	.dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
DW$103	.dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
	.dwattr DW$103, DW_AT_name("FiqIVec_UB"), DW_AT_symbol_name("_FiqIVec_UB")
	.dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
DW$104	.dwtag  DW_TAG_member, DW_AT_type(*DWT$6)
	.dwattr DW$104, DW_AT_name("CimIVec_UB"), DW_AT_symbol_name("_CimIVec_UB")
	.dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
DW$105	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$105, DW_AT_name("Firqpr_UL"), DW_AT_symbol_name("_Firqpr_UL")
	.dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
DW$106	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$106, DW_AT_name("Intreq_UL"), DW_AT_symbol_name("_Intreq_UL")
	.dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
DW$107	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$107, DW_AT_name("Reqmask_UL"), DW_AT_symbol_name("_Reqmask_UL")
	.dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1072


DWT$1076	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1076, DW_AT_byte_size(0x30)
DW$108	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$108, DW_AT_name("ClkCntl_UW"), DW_AT_symbol_name("_ClkCntl_UW")
	.dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
DW$109	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$109, DW_AT_name("CramCR_UW"), DW_AT_symbol_name("_CramCR_UW")
	.dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
DW$110	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$110, DW_AT_name("GlbCtrl_UW"), DW_AT_symbol_name("_GlbCtrl_UW")
	.dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
DW$111	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$111, DW_AT_name("SysECR_UW"), DW_AT_symbol_name("_SysECR_UW")
	.dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
DW$112	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$112, DW_AT_name("SysESR_UW"), DW_AT_symbol_name("_SysESR_UW")
	.dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
DW$113	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$113, DW_AT_name("AbrtESR_UW"), DW_AT_symbol_name("_AbrtESR_UW")
	.dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
DW$114	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$114, DW_AT_name("GlbStat_UW"), DW_AT_symbol_name("_GlbStat_UW")
	.dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
DW$115	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$115, DW_AT_name("Dev_UW"), DW_AT_symbol_name("_Dev_UW")
	.dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
DW$116	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$116, DW_AT_name("Ssif_UW"), DW_AT_symbol_name("_Ssif_UW")
	.dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
DW$117	.dwtag  DW_TAG_member, DW_AT_type(*DWT$8)
	.dwattr DW$117, DW_AT_name("Ssir_UW"), DW_AT_symbol_name("_Ssir_UW")
	.dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1076


DWT$1079	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1079, DW_AT_byte_size(0x04)
DW$118	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$118, DW_AT_name("RTIM_B3"), DW_AT_symbol_name("_RTIM_B3")
	.dwattr DW$118, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x03)
	.dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
DW$119	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$119, DW_AT_name("PREDL_B11"), DW_AT_symbol_name("_PREDL_B11")
	.dwattr DW$119, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
	.dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1079


DWT$1093	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1093, DW_AT_name("rti")
	.dwattr DWT$1093, DW_AT_byte_size(0x20)
DW$120	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1086)
	.dwattr DW$120, DW_AT_name("DRTICNTR_UN"), DW_AT_symbol_name("_DRTICNTR_UN")
	.dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
DW$121	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1087)
	.dwattr DW$121, DW_AT_name("DRTIPCTL_UN"), DW_AT_symbol_name("_DRTIPCTL_UN")
	.dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
DW$122	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1089)
	.dwattr DW$122, DW_AT_name("DRTICNTL_UN"), DW_AT_symbol_name("_DRTICNTL_UN")
	.dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
DW$123	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$123, DW_AT_name("WKEY_UL"), DW_AT_symbol_name("_WKEY_UL")
	.dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
DW$124	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$124, DW_AT_name("RTICR1_UL"), DW_AT_symbol_name("_RTICR1_UL")
	.dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
DW$125	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$125, DW_AT_name("RTICR2_UL"), DW_AT_symbol_name("_RTICR2_UL")
	.dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
DW$126	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1091)
	.dwattr DW$126, DW_AT_name("DRTICINT_UN"), DW_AT_symbol_name("_DRTICINT_UN")
	.dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
DW$127	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1092)
	.dwattr DW$127, DW_AT_name("DRTICNTEN_UN"), DW_AT_symbol_name("_DRTICNTEN_UN")
	.dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1093


DWT$1057	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1057, DW_AT_name("_HALINTERFACE")
	.dwattr DWT$1057, DW_AT_byte_size(0x08)
DW$128	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1055)
	.dwattr DW$128, DW_AT_name("IntClkFrequency_UL"), DW_AT_symbol_name("_IntClkFrequency_UL")
	.dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
DW$129	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1056)
	.dwattr DW$129, DW_AT_name("IntWdtTimeout_UW"), DW_AT_symbol_name("_IntWdtTimeout_UW")
	.dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1057


DWT$1086	.dwtag  DW_TAG_union_type
	.dwattr DWT$1086, DW_AT_byte_size(0x04)
DW$130	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$130, DW_AT_name("DRTICNTR_UL"), DW_AT_symbol_name("_DRTICNTR_UL")
	.dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
DW$131	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1085)
	.dwattr DW$131, DW_AT_name("DRTICNTR_ST"), DW_AT_symbol_name("_DRTICNTR_ST")
	.dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1086


DWT$1087	.dwtag  DW_TAG_union_type
	.dwattr DWT$1087, DW_AT_byte_size(0x04)
DW$132	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$132, DW_AT_name("DRTIPCTL_UL"), DW_AT_symbol_name("_DRTIPCTL_UL")
	.dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
DW$133	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1079)
	.dwattr DW$133, DW_AT_name("DRTIPCTL_ST"), DW_AT_symbol_name("_DRTIPCTL_ST")
	.dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1087


DWT$1089	.dwtag  DW_TAG_union_type
	.dwattr DWT$1089, DW_AT_byte_size(0x04)
DW$134	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$134, DW_AT_name("DRTICNTL_UL"), DW_AT_symbol_name("_DRTICNTL_UL")
	.dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
DW$135	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1088)
	.dwattr DW$135, DW_AT_name("DRTICNTL_ST"), DW_AT_symbol_name("_DRTICNTL_ST")
	.dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1089


DWT$1091	.dwtag  DW_TAG_union_type
	.dwattr DWT$1091, DW_AT_byte_size(0x04)
DW$136	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$136, DW_AT_name("DRTICINT_UL"), DW_AT_symbol_name("_DRTICINT_UL")
	.dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
DW$137	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1090)
	.dwattr DW$137, DW_AT_name("DRTICINT_ST"), DW_AT_symbol_name("_DRTICINT_ST")
	.dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1091


DWT$1092	.dwtag  DW_TAG_union_type
	.dwattr DWT$1092, DW_AT_byte_size(0x04)
DW$138	.dwtag  DW_TAG_member, DW_AT_type(*DWT$12)
	.dwattr DW$138, DW_AT_name("DRTICNTEN_UL"), DW_AT_symbol_name("_DRTICNTEN_UL")
	.dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
DW$139	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1082)
	.dwattr DW$139, DW_AT_name("DRTICNTEN_ST"), DW_AT_symbol_name("_DRTICNTEN_ST")
	.dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1092

DWT$1056	.dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_UWORD"), DW_AT_type(*DWT$1022)
	.dwattr DWT$1056, DW_AT_language(DW_LANG_C)
DWT$1055	.dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_ULONG"), DW_AT_type(*DWT$1020)
	.dwattr DWT$1055, DW_AT_language(DW_LANG_C)

DWT$1082	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1082, DW_AT_byte_size(0x04)
DW$140	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$140, DW_AT_name("CNTEN_B2"), DW_AT_symbol_name("_CNTEN_B2")
	.dwattr DW$140, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
	.dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1082


DWT$1085	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1085, DW_AT_byte_size(0x04)
DW$141	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$141, DW_AT_name("DRTICNTR_B21"), DW_AT_symbol_name("_DRTICNTR_B21")
	.dwattr DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x15)
	.dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
DW$142	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$142, DW_AT_name("DRTIMOD_B11"), DW_AT_symbol_name("_DRTIMOD_B11")
	.dwattr DW$142, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x0b)
	.dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1085


DWT$1088	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1088, DW_AT_byte_size(0x04)
DW$143	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$143, DW_AT_name("RTIF_B1"), DW_AT_symbol_name("_RTIF_B1")
	.dwattr DW$143, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
DW$144	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$144, DW_AT_name("RTIE_B1"), DW_AT_symbol_name("_RTIE_B1")
	.dwattr DW$144, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1088


DWT$1090	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1090, DW_AT_byte_size(0x04)
DW$145	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$145, DW_AT_name("CF1_B1"), DW_AT_symbol_name("_CF1_B1")
	.dwattr DW$145, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
	.dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
DW$146	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$146, DW_AT_name("CF2_B1"), DW_AT_symbol_name("_CF2_B1")
	.dwattr DW$146, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
	.dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
DW$147	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$147, DW_AT_name("CE1_B1"), DW_AT_symbol_name("_CE1_B1")
	.dwattr DW$147, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
DW$148	.dwtag  DW_TAG_member, DW_AT_type(*DWT$10)
	.dwattr DW$148, DW_AT_name("CR2_B1"), DW_AT_symbol_name("_CR2_B1")
	.dwattr DW$148, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1090


	.dwattr DW$22, DW_AT_external(0x01)
	.dwattr DW$46, DW_AT_external(0x01)
	.dwattr DW$48, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_type(*DWT$1021)
	.dwattr DW$54, DW_AT_external(0x01)
	.dwattr DW$54, DW_AT_type(*DWT$1019)
	.dwattr DW$51, DW_AT_external(0x01)
	.dwattr DW$51, DW_AT_type(*DWT$1019)
	.dwattr DW$12, DW_AT_external(0x01)
	.dwattr DW$26, DW_AT_external(0x01)
	.dwattr DW$43, DW_AT_external(0x01)
	.dwattr DW$39, DW_AT_external(0x01)
	.dwattr DW$36, DW_AT_external(0x01)
	.dwattr DW$77, DW_AT_external(0x01)
	.dwattr DW$77, DW_AT_type(*DWT$1018)
	.dwattr DW$73, DW_AT_external(0x01)
	.dwattr DW$56, DW_AT_external(0x01)
	.dwattr DWCU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 26
	.dwcfa	0x0c, 13, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x08, 4
	.dwcfa	0x08, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$149	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$149, DW_AT_location[DW_OP_reg0]
DW$150	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$150, DW_AT_location[DW_OP_reg1]
DW$151	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$151, DW_AT_location[DW_OP_reg2]
DW$152	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$152, DW_AT_location[DW_OP_reg3]
DW$153	.dwtag  DW_TAG_assign_register, DW_AT_name("V1")
	.dwattr DW$153, DW_AT_location[DW_OP_reg4]
DW$154	.dwtag  DW_TAG_assign_register, DW_AT_name("V2")
	.dwattr DW$154, DW_AT_location[DW_OP_reg5]
DW$155	.dwtag  DW_TAG_assign_register, DW_AT_name("V3")
	.dwattr DW$155, DW_AT_location[DW_OP_reg6]
DW$156	.dwtag  DW_TAG_assign_register, DW_AT_name("V4")
	.dwattr DW$156, DW_AT_location[DW_OP_reg7]
DW$157	.dwtag  DW_TAG_assign_register, DW_AT_name("V5")
	.dwattr DW$157, DW_AT_location[DW_OP_reg8]
DW$158	.dwtag  DW_TAG_assign_register, DW_AT_name("V6")
	.dwattr DW$158, DW_AT_location[DW_OP_reg9]
DW$159	.dwtag  DW_TAG_assign_register, DW_AT_name("V7")
	.dwattr DW$159, DW_AT_location[DW_OP_reg10]
DW$160	.dwtag  DW_TAG_assign_register, DW_AT_name("V8")
	.dwattr DW$160, DW_AT_location[DW_OP_reg11]
DW$161	.dwtag  DW_TAG_assign_register, DW_AT_name("V9")
	.dwattr DW$161, DW_AT_location[DW_OP_reg12]
DW$162	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$162, DW_AT_location[DW_OP_reg13]
DW$163	.dwtag  DW_TAG_assign_register, DW_AT_name("LR")
	.dwattr DW$163, DW_AT_location[DW_OP_reg14]
DW$164	.dwtag  DW_TAG_assign_register, DW_AT_name("PC")
	.dwattr DW$164, DW_AT_location[DW_OP_reg15]
DW$165	.dwtag  DW_TAG_assign_register, DW_AT_name("C0")
	.dwattr DW$165, DW_AT_location[DW_OP_reg16]
DW$166	.dwtag  DW_TAG_assign_register, DW_AT_name("C1")
	.dwattr DW$166, DW_AT_location[DW_OP_reg17]
DW$167	.dwtag  DW_TAG_assign_register, DW_AT_name("C2")
	.dwattr DW$167, DW_AT_location[DW_OP_reg18]
DW$168	.dwtag  DW_TAG_assign_register, DW_AT_name("C3")
	.dwattr DW$168, DW_AT_location[DW_OP_reg19]
DW$169	.dwtag  DW_TAG_assign_register, DW_AT_name("C4")
	.dwattr DW$169, DW_AT_location[DW_OP_reg20]
DW$170	.dwtag  DW_TAG_assign_register, DW_AT_name("C5")
	.dwattr DW$170, DW_AT_location[DW_OP_reg21]
DW$171	.dwtag  DW_TAG_assign_register, DW_AT_name("C6")
