;******************************************************************************
;* TMS470 C/C++ Codegen                                       PC Version 2.71 *
;* Date/Time created: Fri Dec 09 13:08:58 2011                                *
;******************************************************************************
	.state16

DWCU	.dwtag  DW_TAG_compile_unit
	.dwattr DWCU, DW_AT_name("ADLATUS_CanHandler.c")
	.dwattr DWCU, DW_AT_producer("TMS470 C/C++ Codegen PC Version 2.71 Copyright (c) 1996-2008 Texas Instruments Incorporated")
	.dwattr DWCU, DW_AT_stmt_list(0x00)
	.dwattr DWCU, DW_AT_TI_VERSION(0x01)

DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("FUN_CCtim_SystemTimerCheck_V"), DW_AT_symbol_name("$FUN_CCtim_SystemTimerCheck_V")
	.dwattr DW$1, DW_AT_declaration(0x01)
	.dwattr DW$1, DW_AT_external(0x01)
DW$2	.dwtag  DW_TAG_variable, DW_AT_name("e_SCC_ST"), DW_AT_symbol_name("_e_SCC_ST")
	.dwattr DW$2, DW_AT_type(*DWT$1144)
	.dwattr DW$2, DW_AT_declaration(0x01)
	.dwattr DW$2, DW_AT_external(0x01)
DW$3	.dwtag  DW_TAG_variable, DW_AT_name("e_CAN_MB"), DW_AT_symbol_name("_e_CAN_MB")
	.dwattr DW$3, DW_AT_type(*DWT$1179)
	.dwattr DW$3, DW_AT_declaration(0x01)
	.dwattr DW$3, DW_AT_external(0x01)

	.sect	".const"
	.align	4
_c_CCcan_TestPattern_AUB:
	.field  	90,8			; _c_CCcan_TestPattern_AUB[0] @ 0
	.field  	165,8			; _c_CCcan_TestPattern_AUB[1] @ 8
	.field  	0,8			; _c_CCcan_TestPattern_AUB[2] @ 16

	.sect	".text"
	.global	_c_CCcan_TestPattern_AUB

	.dwattr DWT$1025, DW_AT_language(DW_LANG_C)
DW$253	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
DW$254	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1023)
	.dwendtag DWT$1025

DWT$1026	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1018)

DWT$1027	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1026)
	.dwattr DWT$1027, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1027, DW_AT_byte_size(0x03)
DW$255	.dwtag  DW_TAG_subrange_type
	.dwattr DW$255, DW_AT_upper_bound(0x02)
	.dwendtag DWT$1027


DWT$1029	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1029, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1029, DW_AT_byte_size(0x30)
DW$256	.dwtag  DW_TAG_subrange_type
	.dwattr DW$256, DW_AT_upper_bound(0x03)
DW$257	.dwtag  DW_TAG_subrange_type
	.dwattr DW$257, DW_AT_upper_bound(0x0b)
	.dwendtag DWT$1029

DWT$1030	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1030, DW_AT_address_class(0x20)
DWT$1035	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1033)
	.dwattr DWT$1035, DW_AT_address_class(0x20)
DWT$1038	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1036)
	.dwattr DWT$1038, DW_AT_address_class(0x20)
DWT$1040	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1039)
	.dwattr DWT$1040, DW_AT_address_class(0x20)
DWT$1041	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$6)
	.dwattr DWT$1041, DW_AT_address_class(0x20)
DWT$1044	.dwtag  DW_TAG_typedef, DW_AT_name("UWORD"), DW_AT_type(*DWT$8)
	.dwattr DWT$1044, DW_AT_language(DW_LANG_C)
DWT$11	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DWT$11, DW_AT_encoding(DW_ATE_signed)
	.dwattr DWT$11, DW_AT_byte_size(0x04)
DWT$10	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DWT$10, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$10, DW_AT_byte_size(0x04)
DWT$1054	.dwtag  DW_TAG_typedef, DW_AT_name("ULONG"), DW_AT_type(*DWT$12)
	.dwattr DWT$1054, DW_AT_language(DW_LANG_C)

DWT$1056	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1055)
	.dwattr DWT$1056, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1056, DW_AT_byte_size(0x2c)
DW$258	.dwtag  DW_TAG_subrange_type
	.dwattr DW$258, DW_AT_upper_bound(0x0a)
	.dwendtag DWT$1056


DWT$1057	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1057, DW_AT_language(DW_LANG_C)

DWT$1078	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1078, DW_AT_language(DW_LANG_C)
DW$259	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1077)
	.dwendtag DWT$1078


DWT$1079	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1079, DW_AT_language(DW_LANG_C)
DW$260	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1018)
	.dwendtag DWT$1079


DWT$1081	.dwtag  DW_TAG_subroutine_type
	.dwattr DWT$1081, DW_AT_language(DW_LANG_C)
DW$261	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1080)
DW$262	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DWT$1044)
	.dwendtag DWT$1081

DWT$1080	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1060)
	.dwattr DWT$1080, DW_AT_address_class(0x20)
DWT$1083	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1080)
DWT$1084	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1059)
	.dwattr DWT$1084, DW_AT_address_class(0x20)
DWT$1066	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1065)
	.dwattr DWT$1066, DW_AT_address_class(0x20)
DWT$1099	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1098)
	.dwattr DWT$1099, DW_AT_address_class(0x20)
DWT$1115	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1114)
	.dwattr DWT$1115, DW_AT_address_class(0x20)
DWT$1116	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1071)
	.dwattr DWT$1116, DW_AT_address_class(0x20)
DWT$1077	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1076)
	.dwattr DWT$1077, DW_AT_address_class(0x20)
DWT$1118	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1077)
DWT$1129	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1128)
	.dwattr DWT$1129, DW_AT_address_class(0x20)
DWT$1134	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1133)
	.dwattr DWT$1134, DW_AT_address_class(0x20)
DWT$1137	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1136)
	.dwattr DWT$1137, DW_AT_address_class(0x20)
DWT$1144	.dwtag  DW_TAG_typedef, DW_AT_name("SCC_ST"), DW_AT_type(*DWT$1143)
	.dwattr DWT$1144, DW_AT_language(DW_LANG_C)
DWT$1145	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1144)
	.dwattr DWT$1145, DW_AT_address_class(0x20)
DWT$1146	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1143)
	.dwattr DWT$1146, DW_AT_address_class(0x20)

DWT$1179	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1178)
	.dwattr DWT$1179, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1179, DW_AT_byte_size(0x100)
DW$263	.dwtag  DW_TAG_subrange_type
	.dwattr DW$263, DW_AT_upper_bound(0x0f)
	.dwendtag DWT$1179

DWT$1181	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1177)
	.dwattr DWT$1181, DW_AT_address_class(0x20)
DWT$1183	.dwtag  DW_TAG_typedef, DW_AT_name("CANCONTROL_ST"), DW_AT_type(*DWT$1182)
	.dwattr DWT$1183, DW_AT_language(DW_LANG_C)
DWT$1184	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1183)
	.dwattr DWT$1184, DW_AT_address_class(0x20)
DWT$1185	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1182)
	.dwattr DWT$1185, DW_AT_address_class(0x20)
DWT$1022	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1021)
	.dwattr DWT$1022, DW_AT_address_class(0x20)
DWT$1033	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$6)

DWT$1036	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$6)
	.dwattr DWT$1036, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1036, DW_AT_byte_size(0x0c)
DW$264	.dwtag  DW_TAG_subrange_type
	.dwattr DW$264, DW_AT_upper_bound(0x0b)
	.dwendtag DWT$1036

DWT$1039	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$6)
DWT$8	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DWT$8, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$8, DW_AT_byte_size(0x02)
DWT$12	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DWT$12, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DWT$12, DW_AT_byte_size(0x04)
DWT$1055	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1054)

DWT$1059	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1059, DW_AT_name("_CANMSGOBJCONFIG")
	.dwattr DWT$1059, DW_AT_byte_size(0x0c)
DW$265	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$265, DW_AT_name("MsgObjectNbr_UB"), DW_AT_symbol_name("_MsgObjectNbr_UB")
	.dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
DW$266	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$266, DW_AT_name("MsgObjState_UB"), DW_AT_symbol_name("_MsgObjState_UB")
	.dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
DW$267	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$267, DW_AT_name("MsgObjDirection_UB"), DW_AT_symbol_name("_MsgObjDirection_UB")
	.dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
DW$268	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$268, DW_AT_name("IDLength_UB"), DW_AT_symbol_name("_IDLength_UB")
	.dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
DW$269	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$269, DW_AT_name("CanIdentifier_UL"), DW_AT_symbol_name("_CanIdentifier_UL")
	.dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
DW$270	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$270, DW_AT_name("AcceptanceMask_UL"), DW_AT_symbol_name("_AcceptanceMask_UL")
	.dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1059

DWT$1060	.dwtag  DW_TAG_typedef, DW_AT_name("CANMSGOBJCONFIG_ST"), DW_AT_type(*DWT$1059)
	.dwattr DWT$1060, DW_AT_language(DW_LANG_C)
DWT$1065	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1064)
DWT$1098	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1063)
DWT$1114	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1063)

DWT$1071	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1071, DW_AT_name("_DIAGRESPONSETG_ST")
	.dwattr DWT$1071, DW_AT_byte_size(0x0a)
DW$271	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$271, DW_AT_name("SendMailBox_UB"), DW_AT_symbol_name("_SendMailBox_UB")
	.dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
DW$272	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$272, DW_AT_name("Reserve_UB"), DW_AT_symbol_name("_Reserve_UB")
	.dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
DW$273	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1020)
	.dwattr DW$273, DW_AT_name("Data_AUB"), DW_AT_symbol_name("_Data_AUB")
	.dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1071

DWT$1076	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1075)
DWT$1128	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1127)
DWT$1133	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1132)
DWT$1136	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1135)
DWT$1143	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1142)
DWT$1177	.dwtag  DW_TAG_volatile_type, DW_AT_type(*DWT$1176)
DWT$1178	.dwtag  DW_TAG_typedef, DW_AT_name("CANMBOX"), DW_AT_type(*DWT$1177)
	.dwattr DWT$1178, DW_AT_language(DW_LANG_C)

DWT$1182	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1182, DW_AT_name("_CANCONTROL")
	.dwattr DWT$1182, DW_AT_byte_size(0x24)
DW$274	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1080)
	.dwattr DW$274, DW_AT_name("CanMsgObjConfig_PST"), DW_AT_symbol_name("_CanMsgObjConfig_PST")
	.dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
DW$275	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1066)
	.dwattr DW$275, DW_AT_name("CanChannelTable_PST"), DW_AT_symbol_name("_CanChannelTable_PST")
	.dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
DW$276	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$276, DW_AT_name("QuarzClockFrequency_UL"), DW_AT_symbol_name("_QuarzClockFrequency_UL")
	.dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
DW$277	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$277, DW_AT_name("CanNode_UW"), DW_AT_symbol_name("_CanNode_UW")
	.dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
DW$278	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$278, DW_AT_name("DefaultBaudrate_UB"), DW_AT_symbol_name("_DefaultBaudrate_UB")
	.dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
DW$279	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$279, DW_AT_name("SelectedChannel_UB"), DW_AT_symbol_name("_SelectedChannel_UB")
	.dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
DW$280	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$280, DW_AT_name("MbUsedinRAM_UB"), DW_AT_symbol_name("_MbUsedinRAM_UB")
	.dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
DW$281	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$281, DW_AT_name("RepeatCounter_UB"), DW_AT_symbol_name("_RepeatCounter_UB")
	.dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
DW$282	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1030)
	.dwattr DW$282, DW_AT_name("SendData_PUB"), DW_AT_symbol_name("_SendData_PUB")
	.dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
DW$283	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$283, DW_AT_name("MbUsedforStartup_UB"), DW_AT_symbol_name("_MbUsedforStartup_UB")
	.dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
DW$284	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1073)
	.dwattr DW$284, DW_AT_name("DiagResponseTG_PST"), DW_AT_symbol_name("_DiagResponseTG_PST")
	.dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
DW$285	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$285, DW_AT_name("WriteIndex_AUB"), DW_AT_symbol_name("_WriteIndex_AUB")
	.dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
DW$286	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$286, DW_AT_name("ReadIndex_AUB"), DW_AT_symbol_name("_ReadIndex_AUB")
	.dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1182

DWT$1021	.dwtag  DW_TAG_typedef, DW_AT_name("BUFFER_UB"), DW_AT_type(*DWT$1018)
	.dwattr DWT$1021, DW_AT_language(DW_LANG_C)

DWT$1063	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1063, DW_AT_name("_CANMSGOBJINFO")
	.dwattr DWT$1063, DW_AT_byte_size(0x04)
DW$287	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$287, DW_AT_name("MsgObjectNbr_UB"), DW_AT_symbol_name("_MsgObjectNbr_UB")
	.dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
DW$288	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$288, DW_AT_name("ChannelNbr_UB"), DW_AT_symbol_name("_ChannelNbr_UB")
	.dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
DW$289	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$289, DW_AT_name("AddIdByteInfo_UB"), DW_AT_symbol_name("_AddIdByteInfo_UB")
	.dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
DW$290	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$290, DW_AT_name("AddIdentifier_UB"), DW_AT_symbol_name("_AddIdentifier_UB")
	.dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1063

DWT$1064	.dwtag  DW_TAG_typedef, DW_AT_name("CANMSGOBJINFO_ST"), DW_AT_type(*DWT$1063)
	.dwattr DWT$1064, DW_AT_language(DW_LANG_C)
DWT$1073	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1072)
	.dwattr DWT$1073, DW_AT_address_class(0x20)
DWT$1075	.dwtag  DW_TAG_typedef, DW_AT_name("CANINTERFACE_ST"), DW_AT_type(*DWT$1074)
	.dwattr DWT$1075, DW_AT_language(DW_LANG_C)

DWT$1127	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1127, DW_AT_byte_size(0x02)
DW$291	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$291, DW_AT_name("LNTC_B1"), DW_AT_symbol_name("_LNTC_B1")
	.dwattr DW$291, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
DW$292	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$292, DW_AT_name("LNTM_B1"), DW_AT_symbol_name("_LNTM_B1")
	.dwattr DW$292, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
DW$293	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$293, DW_AT_name("SCM_B1"), DW_AT_symbol_name("_SCM_B1")
	.dwattr DW$293, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
DW$294	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$294, DW_AT_name("CCR_B1"), DW_AT_symbol_name("_CCR_B1")
	.dwattr DW$294, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
DW$295	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$295, DW_AT_name("PDR_B1"), DW_AT_symbol_name("_PDR_B1")
	.dwattr DW$295, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
DW$296	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$296, DW_AT_name("DBO_B1"), DW_AT_symbol_name("_DBO_B1")
	.dwattr DW$296, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
DW$297	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$297, DW_AT_name("WUBA_B1"), DW_AT_symbol_name("_WUBA_B1")
	.dwattr DW$297, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
DW$298	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$298, DW_AT_name("CDR_B1"), DW_AT_symbol_name("_CDR_B1")
	.dwattr DW$298, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
DW$299	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$299, DW_AT_name("ABO_B1"), DW_AT_symbol_name("_ABO_B1")
	.dwattr DW$299, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
DW$300	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$300, DW_AT_name("STM_B1"), DW_AT_symbol_name("_STM_B1")
	.dwattr DW$300, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
DW$301	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$301, DW_AT_name("SRES_B1"), DW_AT_symbol_name("_SRES_B1")
	.dwattr DW$301, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
DW$302	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$302, DW_AT_name("WBNR_B5"), DW_AT_symbol_name("_WBNR_B5")
	.dwattr DW$302, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1127


DWT$1132	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1132, DW_AT_byte_size(0x04)
DW$303	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$303, DW_AT_name("Notused1"), DW_AT_symbol_name("_Notused1")
	.dwattr DW$303, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
	.dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
DW$304	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$304, DW_AT_name("FE_B1"), DW_AT_symbol_name("_FE_B1")
	.dwattr DW$304, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$305, DW_AT_name("BE_B1"), DW_AT_symbol_name("_BE_B1")
	.dwattr DW$305, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$306, DW_AT_name("SA1_B1"), DW_AT_symbol_name("_SA1_B1")
	.dwattr DW$306, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$307, DW_AT_name("CRCE_B1"), DW_AT_symbol_name("_CRCE_B1")
	.dwattr DW$307, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$308, DW_AT_name("SE_B1"), DW_AT_symbol_name("_SE_B1")
	.dwattr DW$308, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
DW$309	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$309, DW_AT_name("ACKE_B1"), DW_AT_symbol_name("_ACKE_B1")
	.dwattr DW$309, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
DW$310	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$310, DW_AT_name("BO_B1"), DW_AT_symbol_name("_BO_B1")
	.dwattr DW$310, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
DW$311	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$311, DW_AT_name("EP_B1"), DW_AT_symbol_name("_EP_B1")
	.dwattr DW$311, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
DW$312	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$312, DW_AT_name("EW_B1"), DW_AT_symbol_name("_EW_B1")
	.dwattr DW$312, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
DW$313	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$313, DW_AT_name("Notused2"), DW_AT_symbol_name("_Notused2")
	.dwattr DW$313, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x0a)
	.dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
DW$314	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$314, DW_AT_name("SMA_B1"), DW_AT_symbol_name("_SMA_B1")
	.dwattr DW$314, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
	.dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
DW$315	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$315, DW_AT_name("CCE_B1"), DW_AT_symbol_name("_CCE_B1")
	.dwattr DW$315, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
	.dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
DW$316	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$316, DW_AT_name("PDA_B1"), DW_AT_symbol_name("_PDA_B1")
	.dwattr DW$316, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
DW$317	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$317, DW_AT_name("Notused3"), DW_AT_symbol_name("_Notused3")
	.dwattr DW$317, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
DW$318	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$318, DW_AT_name("RM_B1"), DW_AT_symbol_name("_RM_B1")
	.dwattr DW$318, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
DW$319	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$319, DW_AT_name("TM_B1"), DW_AT_symbol_name("_TM_B1")
	.dwattr DW$319, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1132


DWT$1135	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1135, DW_AT_byte_size(0x04)
DW$320	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$320, DW_AT_name("Notused1"), DW_AT_symbol_name("_Notused1")
	.dwattr DW$320, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
	.dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
DW$321	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$321, DW_AT_name("TXFUNC_B1"), DW_AT_symbol_name("_TXFUNC_B1")
	.dwattr DW$321, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
DW$322	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$322, DW_AT_name("TXDIR_B1"), DW_AT_symbol_name("_TXDIR_B1")
	.dwattr DW$322, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
DW$323	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$323, DW_AT_name("TXOUT_B1"), DW_AT_symbol_name("_TXOUT_B1")
	.dwattr DW$323, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
DW$324	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$324, DW_AT_name("TXIN_B1"), DW_AT_symbol_name("_TXIN_B1")
	.dwattr DW$324, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1135


DWT$1142	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1142, DW_AT_name("scc_st")
	.dwattr DWT$1142, DW_AT_byte_size(0x5c)
DW$325	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$325, DW_AT_name("CANME_UL"), DW_AT_symbol_name("_CANME_UL")
	.dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
DW$326	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$326, DW_AT_name("CANMD_UL"), DW_AT_symbol_name("_CANMD_UL")
	.dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
DW$327	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$327, DW_AT_name("CANTRS_UL"), DW_AT_symbol_name("_CANTRS_UL")
	.dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
DW$328	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$328, DW_AT_name("CANTRR_UL"), DW_AT_symbol_name("_CANTRR_UL")
	.dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
DW$329	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$329, DW_AT_name("CANTA_UL"), DW_AT_symbol_name("_CANTA_UL")
	.dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
DW$330	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$330, DW_AT_name("CANAA_UL"), DW_AT_symbol_name("_CANAA_UL")
	.dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
DW$331	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$331, DW_AT_name("CANRMP_UL"), DW_AT_symbol_name("_CANRMP_UL")
	.dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
DW$332	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$332, DW_AT_name("CANRML_UL"), DW_AT_symbol_name("_CANRML_UL")
	.dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
DW$333	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$333, DW_AT_name("CANRFP_UL"), DW_AT_symbol_name("_CANRFP_UL")
	.dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
DW$334	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$334, DW_AT_name("CANGAM_UL"), DW_AT_symbol_name("_CANGAM_UL")
	.dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
DW$335	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1130)
	.dwattr DW$335, DW_AT_name("CANMC_UN"), DW_AT_symbol_name("_CANMC_UN")
	.dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
DW$336	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$336, DW_AT_name("CANBTC_UL"), DW_AT_symbol_name("_CANBTC_UL")
	.dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
DW$337	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1138)
	.dwattr DW$337, DW_AT_name("CANES_UN"), DW_AT_symbol_name("_CANES_UN")
	.dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
DW$338	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$338, DW_AT_name("notused1"), DW_AT_symbol_name("_notused1")
	.dwattr DW$338, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
DW$339	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$339, DW_AT_name("CANTEC_UL"), DW_AT_symbol_name("_CANTEC_UL")
	.dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
DW$340	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$340, DW_AT_name("notused2"), DW_AT_symbol_name("_notused2")
	.dwattr DW$340, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
	.dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
DW$341	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$341, DW_AT_name("CANREC_UL"), DW_AT_symbol_name("_CANREC_UL")
	.dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
DW$342	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$342, DW_AT_name("CANGIFO_UL"), DW_AT_symbol_name("_CANGIFO_UL")
	.dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
DW$343	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$343, DW_AT_name("CANGIM_UL"), DW_AT_symbol_name("_CANGIM_UL")
	.dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
DW$344	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$344, DW_AT_name("CANGIF1_UL"), DW_AT_symbol_name("_CANGIF1_UL")
	.dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
DW$345	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$345, DW_AT_name("CANMIM_UL"), DW_AT_symbol_name("_CANMIM_UL")
	.dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
DW$346	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$346, DW_AT_name("CANMIL_UL"), DW_AT_symbol_name("_CANMIL_UL")
	.dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
DW$347	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$347, DW_AT_name("CANOPC_UL"), DW_AT_symbol_name("_CANOPC_UL")
	.dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
DW$348	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1139)
	.dwattr DW$348, DW_AT_name("CANTIOC_UN"), DW_AT_symbol_name("_CANTIOC_UN")
	.dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
DW$349	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1141)
	.dwattr DW$349, DW_AT_name("CANRIOC_UN"), DW_AT_symbol_name("_CANRIOC_UN")
	.dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1142


DWT$1176	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1176, DW_AT_name("can_mbox_st")
	.dwattr DWT$1176, DW_AT_byte_size(0x10)
DW$350	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1153)
	.dwattr DW$350, DW_AT_name("MID_ST"), DW_AT_symbol_name("_MID_ST")
	.dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
DW$351	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1165)
	.dwattr DW$351, DW_AT_name("MCF_ST"), DW_AT_symbol_name("_MCF_ST")
	.dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
DW$352	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1175)
	.dwattr DW$352, DW_AT_name("u"), DW_AT_symbol_name("_u")
	.dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1176

DWT$1126	.dwtag  DW_TAG_typedef, DW_AT_name("BITFIELD"), DW_AT_type(*DWT$10)
	.dwattr DWT$1126, DW_AT_language(DW_LANG_C)
DWT$1072	.dwtag  DW_TAG_typedef, DW_AT_name("DIAGRESPONSETG_ST"), DW_AT_type(*DWT$1071)
	.dwattr DWT$1072, DW_AT_language(DW_LANG_C)

DWT$1074	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1074, DW_AT_name("_CANINTERFACE")
	.dwattr DWT$1074, DW_AT_byte_size(0x18)
DW$353	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1062)
	.dwattr DW$353, DW_AT_name("CanMsgObjConfig_PST"), DW_AT_symbol_name("_CanMsgObjConfig_PST")
	.dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
DW$354	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1066)
	.dwattr DW$354, DW_AT_name("CanChannelTable_PST"), DW_AT_symbol_name("_CanChannelTable_PST")
	.dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
DW$355	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1068)
	.dwattr DW$355, DW_AT_name("QuarzClockFrequency_PUL"), DW_AT_symbol_name("_QuarzClockFrequency_PUL")
	.dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
DW$356	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1070)
	.dwattr DW$356, DW_AT_name("CanNode_PUW"), DW_AT_symbol_name("_CanNode_PUW")
	.dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
DW$357	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1070)
	.dwattr DW$357, DW_AT_name("DefaultBaudrate_PUW"), DW_AT_symbol_name("_DefaultBaudrate_PUW")
	.dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
DW$358	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1073)
	.dwattr DW$358, DW_AT_name("DiagResponseTG_PST"), DW_AT_symbol_name("_DiagResponseTG_PST")
	.dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1074


DWT$1130	.dwtag  DW_TAG_union_type
	.dwattr DWT$1130, DW_AT_byte_size(0x02)
DW$359	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$359, DW_AT_name("CANMC_UW"), DW_AT_symbol_name("_CANMC_UW")
	.dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
DW$360	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1127)
	.dwattr DW$360, DW_AT_name("CANMC_ST"), DW_AT_symbol_name("_CANMC_ST")
	.dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1130


DWT$1138	.dwtag  DW_TAG_union_type
	.dwattr DWT$1138, DW_AT_byte_size(0x04)
DW$361	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$361, DW_AT_name("CANES_UL"), DW_AT_symbol_name("_CANES_UL")
	.dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
DW$362	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1132)
	.dwattr DW$362, DW_AT_name("CANES_ST"), DW_AT_symbol_name("_CANES_ST")
	.dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1138


DWT$1139	.dwtag  DW_TAG_union_type
	.dwattr DWT$1139, DW_AT_byte_size(0x04)
DW$363	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$363, DW_AT_name("CANTIOC_UL"), DW_AT_symbol_name("_CANTIOC_UL")
	.dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
DW$364	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1135)
	.dwattr DW$364, DW_AT_name("CANTIOC_ST"), DW_AT_symbol_name("_CANTIOC_ST")
	.dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1139


DWT$1141	.dwtag  DW_TAG_union_type
	.dwattr DWT$1141, DW_AT_byte_size(0x04)
DW$365	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$365, DW_AT_name("CANRIOC_UL"), DW_AT_symbol_name("_CANRIOC_UL")
	.dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
DW$366	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1140)
	.dwattr DW$366, DW_AT_name("CANRIOC_ST"), DW_AT_symbol_name("_CANRIOC_ST")
	.dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1141


DWT$1153	.dwtag  DW_TAG_union_type
	.dwattr DWT$1153, DW_AT_byte_size(0x04)
DW$367	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1152)
	.dwattr DW$367, DW_AT_name("w"), DW_AT_symbol_name("_w")
	.dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
DW$368	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1147)
	.dwattr DW$368, DW_AT_name("l"), DW_AT_symbol_name("_l")
	.dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1153


DWT$1165	.dwtag  DW_TAG_union_type
	.dwattr DWT$1165, DW_AT_byte_size(0x04)
DW$369	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1158)
	.dwattr DW$369, DW_AT_name("bw"), DW_AT_symbol_name("_bw")
	.dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
DW$370	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1162)
	.dwattr DW$370, DW_AT_name("l"), DW_AT_symbol_name("_l")
	.dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1165


DWT$1175	.dwtag  DW_TAG_union_type
	.dwattr DWT$1175, DW_AT_byte_size(0x08)
DW$371	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1171)
	.dwattr DW$371, DW_AT_name("l"), DW_AT_symbol_name("_l")
	.dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
DW$372	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1172)
	.dwattr DW$372, DW_AT_name("w"), DW_AT_symbol_name("_w")
	.dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
DW$373	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1173)
	.dwattr DW$373, DW_AT_name("c"), DW_AT_symbol_name("_c")
	.dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
DW$374	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1174)
	.dwattr DW$374, DW_AT_name("CanData_UB"), DW_AT_symbol_name("_CanData_UB")
	.dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1175


DWT$1174	.dwtag  DW_TAG_array_type, DW_AT_type(*DWT$1018)
	.dwattr DWT$1174, DW_AT_language(DW_LANG_C)
	.dwattr DWT$1174, DW_AT_byte_size(0x07)
DW$375	.dwtag  DW_TAG_subrange_type
	.dwattr DW$375, DW_AT_upper_bound(0x06)
	.dwendtag DWT$1174

DWT$1070	.dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_UWORD"), DW_AT_type(*DWT$1069)
	.dwattr DWT$1070, DW_AT_language(DW_LANG_C)
DWT$1068	.dwtag  DW_TAG_typedef, DW_AT_name("FAR_PTR_ULONG"), DW_AT_type(*DWT$1067)
	.dwattr DWT$1068, DW_AT_language(DW_LANG_C)
DWT$1062	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1061)
	.dwattr DWT$1062, DW_AT_address_class(0x20)

DWT$1140	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1140, DW_AT_byte_size(0x04)
DW$376	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$376, DW_AT_name("Notused1"), DW_AT_symbol_name("_Notused1")
	.dwattr DW$376, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
	.dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
DW$377	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$377, DW_AT_name("RXFUNC_B1"), DW_AT_symbol_name("_RXFUNC_B1")
	.dwattr DW$377, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
	.dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
DW$378	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$378, DW_AT_name("RXDIR_B1"), DW_AT_symbol_name("_RXDIR_B1")
	.dwattr DW$378, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
	.dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
DW$379	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$379, DW_AT_name("RXOUT_B1"), DW_AT_symbol_name("_RXOUT_B1")
	.dwattr DW$379, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
	.dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
DW$380	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1126)
	.dwattr DW$380, DW_AT_name("RXIN_B1"), DW_AT_symbol_name("_RXIN_B1")
	.dwattr DW$380, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
	.dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1140


DWT$1147	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1147, DW_AT_byte_size(0x04)
DW$381	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$381, DW_AT_name("CanMID_UL"), DW_AT_symbol_name("_CanMID_UL")
	.dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1147


DWT$1152	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1152, DW_AT_byte_size(0x04)
DW$382	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$382, DW_AT_name("CanMID"), DW_AT_symbol_name("_CanMID")
	.dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
DW$383	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$383, DW_AT_name("CanMID_low_unused"), DW_AT_symbol_name("_CanMID_low_unused")
	.dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1152


DWT$1158	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1158, DW_AT_byte_size(0x04)
DW$384	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$384, DW_AT_name("CanMCF_high_unused"), DW_AT_symbol_name("_CanMCF_high_unused")
	.dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
DW$385	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$385, DW_AT_name("CanMCF_mid_unused"), DW_AT_symbol_name("_CanMCF_mid_unused")
	.dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
DW$386	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$386, DW_AT_name("CanMCF"), DW_AT_symbol_name("_CanMCF")
	.dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1158


DWT$1162	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1162, DW_AT_byte_size(0x04)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$387, DW_AT_name("CanMCF_UL"), DW_AT_symbol_name("_CanMCF_UL")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1162


DWT$1171	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1171, DW_AT_byte_size(0x08)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$388, DW_AT_name("L0"), DW_AT_symbol_name("_L0")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1054)
	.dwattr DW$389, DW_AT_name("L1"), DW_AT_symbol_name("_L1")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1171


DWT$1172	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1172, DW_AT_byte_size(0x08)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$390, DW_AT_name("W0"), DW_AT_symbol_name("_W0")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$391, DW_AT_name("W1"), DW_AT_symbol_name("_W1")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$392, DW_AT_name("W2"), DW_AT_symbol_name("_W2")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1044)
	.dwattr DW$393, DW_AT_name("W3"), DW_AT_symbol_name("_W3")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1172


DWT$1173	.dwtag  DW_TAG_structure_type
	.dwattr DWT$1173, DW_AT_byte_size(0x08)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$394, DW_AT_name("C0"), DW_AT_symbol_name("_C0")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$395, DW_AT_name("C1"), DW_AT_symbol_name("_C1")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$396, DW_AT_name("C2"), DW_AT_symbol_name("_C2")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
DW$397	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$397, DW_AT_name("C3"), DW_AT_symbol_name("_C3")
	.dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
DW$398	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$398, DW_AT_name("C4"), DW_AT_symbol_name("_C4")
	.dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
DW$399	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$399, DW_AT_name("C5"), DW_AT_symbol_name("_C5")
	.dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
DW$400	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$400, DW_AT_name("C6"), DW_AT_symbol_name("_C6")
	.dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
DW$401	.dwtag  DW_TAG_member, DW_AT_type(*DWT$1018)
	.dwattr DW$401, DW_AT_name("C7"), DW_AT_symbol_name("_C7")
	.dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DWT$1173

DWT$1069	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1044)
	.dwattr DWT$1069, DW_AT_address_class(0x20)
DWT$1067	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DWT$1054)
	.dwattr DWT$1067, DW_AT_address_class(0x20)
DWT$1061	.dwtag  DW_TAG_const_type, DW_AT_type(*DWT$1060)

	.dwattr DW$79, DW_AT_external(0x01)
	.dwattr DW$100, DW_AT_external(0x01)
	.dwattr DW$100, DW_AT_type(*DWT$1018)
	.dwattr DW$25, DW_AT_external(0x01)
	.dwattr DW$25, DW_AT_type(*DWT$1018)
	.dwattr DW$84, DW_AT_external(0x01)
	.dwattr DW$55, DW_AT_external(0x01)
	.dwattr DW$89, DW_AT_external(0x01)
	.dwattr DW$50, DW_AT_external(0x01)
	.dwattr DW$168, DW_AT_external(0x01)
	.dwattr DW$168, DW_AT_type(*DWT$1018)
	.dwattr DW$77, DW_AT_external(0x01)
	.dwattr DW$75, DW_AT_external(0x01)
	.dwattr DW$187, DW_AT_external(0x01)
	.dwattr DW$187, DW_AT_type(*DWT$1018)
	.dwattr DW$230, DW_AT_external(0x01)
	.dwattr DW$20, DW_AT_external(0x01)
	.dwattr DW$10, DW_AT_external(0x01)
	.dwattr DW$15, DW_AT_external(0x01)
	.dwattr DWCU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 26
	.dwcfa	0x0c, 13, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x08, 4
	.dwcfa	0x08, 5
	.dwcfa	0x08, 6
	.dwcfa	0x08, 7
	.dwcfa	0x08, 8
	.dwcfa	0x08, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x07, 12
	.dwcfa	0x07, 13
	.dwcfa	0x07, 14
	.dwcfa	0x07, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x07, 26

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$402	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$402, DW_AT_location[DW_OP_reg0]
DW$403	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$403, DW_AT_location[DW_OP_reg1]
DW$404	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$404, DW_AT_location[DW_OP_reg2]
DW$405	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$405, DW_AT_location[DW_OP_reg3]
DW$406	.dwtag  DW_TAG_assign_register, DW_AT_name("V1")
	.dwattr DW$406, DW_AT_location[DW_OP_reg4]
DW$407	.dwtag  DW_TAG_assign_register, DW_AT_name("V2")
	.dwattr DW$407, DW_AT_location[DW_OP_reg5]
DW$408	.dwtag  DW_TAG_assign_register, DW_AT_name("V3")
	.dwattr DW$408, DW_AT_location[DW_OP_reg6]
DW$409	.dwtag  DW_TAG_assign_register, DW_AT_name("V4")
	.dwattr DW$409, DW_AT_location[DW_OP_reg7]
DW$410	.dwtag  DW_TAG_assign_register, DW_AT_name("V5")
	.dwattr DW$410, DW_AT_location[DW_OP_reg8]
DW$411	.dwtag  DW_TAG_assign_register, DW_AT_name("V6")
	.dwattr DW$411, DW_AT_location[DW_OP_reg9]
DW$412	.dwtag  DW_TAG_assign_register, DW_AT_name("V7")
	.dwattr DW$412, DW_AT_location[DW_OP_reg10]
DW$413	.dwtag  DW_TAG_assign_register, DW_AT_name("V8")
	.dwattr DW$413, DW_AT_location[DW_OP_reg11]
DW$414	.dwtag  DW_TAG_assign_register, DW_AT_name("V9")
	.dwattr DW$414, DW_AT_location[DW_OP_reg12]
DW$415	.dwtag  DW_TAG_assign_register, DW_AT_name("SP")
	.dwattr DW$415, DW_AT_location[DW_OP_reg13]
DW$416	.dwtag  DW_TAG_assign_register, DW_AT_name("LR")
	.dwattr DW$416, DW_AT_location[DW_OP_reg14]
DW$417	.dwtag  DW_TAG_assign_register, DW_AT_name("PC")
	.dwattr DW$417, DW_AT_location[DW_OP_reg15]
DW$418	.dwtag  DW_TAG_assign_register, DW_AT_name("C0")
	.dwattr DW$418, DW_AT_location[DW_OP_reg16]
DW$419	.dwtag  DW_TAG_assign_register, DW_AT_name("C1")
	.dwattr DW$419, DW_AT_location[DW_OP_reg17]
DW$420	.dwtag  DW_TAG_assign_register, DW_AT_name("C2")
	.dwattr DW$420, DW_AT_location[DW_OP_reg18]
DW$421	.dwtag  DW_TAG_assign_register, DW_AT_name("C3")
